/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFXGame.BioDeathVFXCore.BioDeathVFXSpec
// 0x0030
struct FBioDeathVFXSpec
{
	struct FVector                                     m_vImpulseOriginOffset;                           		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmLabel;                                        		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             m_pExplosionVFXTemplate;                          		// 0x0014 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             m_pCrustVFXTemplate;                              		// 0x001C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fImpulseRadius;                                 		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fImpulseMagnitude;                              		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsTargetDeletedOnCrustEffectCompletion : 1;    		// 0x002C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsImpulseEnabled : 1;                          		// 0x002C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear_Settings.BioHeadGearComponentSettings
// 0x000C
struct FBioHeadGearComponentSettings
{
	int                                                m_nMeshIndex;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialIndex;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                     		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHidden : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bIsLoaded : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAttributes.BioComplexIntStructAttribute
// 0x0088
struct FBioComplexIntStructAttribute
{
	struct TArray<struct FPointer>                     m_Children;                                       		// 0x0000 (0x0010) [0x0000000000001000]              ( CPF_Native )
	struct TArray<struct FPointer>                     m_FloatChildren;                                  		// 0x0010 (0x0010) [0x0000000000001000]              ( CPF_Native )
	struct TArray<int>                                 m_baseOverrides;                                  		// 0x0020 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<unsigned long>                       m_isBaseOverrideValid;                            		// 0x0030 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FPointer                                    m_Parent;                                         		// 0x0040 (0x0008) [0x0000000000001000]              ( CPF_Native )
	int                                                m_modifiers[ 0x4 ];                               		// 0x0048 (0x0010) [0x0000000000000000]              
	int                                                m_isModifierEnabled[ 0x4 ];                       		// 0x0058 (0x0010) [0x0000000000000000]              
	class UBio2DA*                                     m_LookupTable;                                    		// 0x0068 (0x0008) [0x0000000000000000]              
	int                                                m_Base;                                           		// 0x0070 (0x0004) [0x0000000000000000]              
	int                                                m_Current;                                        		// 0x0074 (0x0004) [0x0000000000000000]              
	int                                                m_Max;                                            		// 0x0078 (0x0004) [0x0000000000000000]              
	int                                                m_Min;                                            		// 0x007C (0x0004) [0x0000000000000000]              
	int                                                m_TableColumn;                                    		// 0x0080 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_isBaseOverrideInEffect : 1;                     		// 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_Dirty : 1;                                      		// 0x0084 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioAttributes.BioComplexFloatStructAttribute
// 0x0068
struct FBioComplexFloatStructAttribute
{
	struct TArray<int>                                 m_baseOverrides;                                  		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<unsigned long>                       m_isBaseOverrideValid;                            		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FPointer                                    m_Parent;                                         		// 0x0020 (0x0008) [0x0000000000001000]              ( CPF_Native )
	float                                              m_modifiers[ 0x4 ];                               		// 0x0028 (0x0010) [0x0000000000000000]              
	int                                                m_isModifierEnabled[ 0x4 ];                       		// 0x0038 (0x0010) [0x0000000000000000]              
	class UBio2DA*                                     m_LookupTable;                                    		// 0x0048 (0x0008) [0x0000000000000000]              
	float                                              m_Base;                                           		// 0x0050 (0x0004) [0x0000000000000000]              
	float                                              m_Current;                                        		// 0x0054 (0x0004) [0x0000000000000000]              
	float                                              m_Max;                                            		// 0x0058 (0x0004) [0x0000000000000000]              
	float                                              m_Min;                                            		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                m_TableColumn;                                    		// 0x0060 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_isBaseOverrideInEffect : 1;                     		// 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_Dirty : 1;                                      		// 0x0064 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.Bio_Appr_Character.FootStepAttachment
// 0x000C
struct FFootStepAttachment
{
	struct FName                                       BoneName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinPeriodTime;                                    		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character.LookAtBoneDef
// 0x0022
struct FLookAtBoneDef
{
	struct FName                                       m_nBoneName;                                      		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fLimit;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fUpDownLimit;                                   		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fDelay;                                         		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fSpeedFactor;                                   		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fConversationStrength;                          		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bSeparateUpDownLimit : 1;                       		// 0x001C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bUseUpAxis : 1;                                 		// 0x001C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bLookAtInverted : 1;                            		// 0x001C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bUpAxisInverted : 1;                            		// 0x001C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned char                                      m_nLookAxis;                                      		// 0x0020 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_nUpAxis;                                        		// 0x0021 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternValue
// 0x004C
struct FPlayerCustomPatternValue
{
	struct FLinearColor                                Stripe1ParameterValue;                            		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ParameterValue;                            		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ParameterValue;                            		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ParameterName;                             		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ParameterName;                             		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ParameterName;                             		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                PatternName;                                      		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternColorValue
// 0x004C
struct FPlayerCustomPatternColorValue
{
	struct FLinearColor                                Stripe1ColorValue;                                		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ColorValue;                                		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ColorValue;                                		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ColorName;                                 		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ColorName;                                 		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ColorName;                                 		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor1Value
// 0x0034
struct FPlayerCustomColor1Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                PhongParameterValue;                              		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       PhongParameterName;                               		// 0x0028 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor2Value
// 0x001C
struct FPlayerCustomColor2Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor3Value
// 0x001C
struct FPlayerCustomColor3Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ModelVariation
// 0x000C
struct FModelVariation
{
	int                                                NumVariations;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaterialsPerVariation;                            		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bHasHeadGear : 1;                               		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ArmorTypes
// 0x0029
struct FArmorTypes
{
	struct TArray<struct FModelVariation>              Variations;                                       		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       m_meshPackageName;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_materialPackageName;                            		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicsAsset*                               ArmorPhysicsAsset;                                		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ArmorType;                                        		// 0x0028 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.OverrideAnimTreeTemplate
// 0x0009
struct FOverrideAnimTreeTemplate
{
	class UAnimTree*                                   AnimTreeTemplate;                                 		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      eClassification;                                  		// 0x0008 (0x0001) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.WeaponAnimSpec
// 0x0019
struct FWeaponAnimSpec
{
	struct TArray<class UAnimSet*>                     m_animSets;                                       		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimSet*                                    m_drawAnimSet;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_weaponType;                                     		// 0x0018 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioCharacterHeadAppearanceMaterialConfig
// 0x0010
struct FBioCharacterHeadAppearanceMaterialConfig
{
	struct TArray<class UMaterialInterface*>           m_aMaterials;                                     		// 0x0000 (0x0010) [0x0000000000400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioWrinkleConfig
// 0x0018
struct FBioWrinkleConfig
{
	struct FString                                     WrinkleParameterName;                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  WrinkleTexture;                                   		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioFacePlateMeshSpec
// 0x000C
struct FBioFacePlateMeshSpec
{
	class USkeletalMesh*                               m_pMesh;                                          		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bHidesVisor : 1;                                		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceModelSpec
// 0x000C
struct FBioHeadGearAppearanceModelSpec
{
	int                                                m_nMaterialConfigCount;                           		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialCountPerConfig;                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHairHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bSuppressFacePlate : 1;                         		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bSuppressVisor : 1;                             		// 0x0008 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceArmorSpec
// 0x0019
struct FBioHeadGearAppearanceArmorSpec
{
	struct TArray<struct FBioHeadGearAppearanceModelSpec> m_aModelSpec;                                     		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       m_nmPackage;                                      		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eArmorType;                                     		// 0x0018 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioVisualEffect.InterpPropertyInfo
// 0x000C
struct FInterpPropertyInfo
{
	class UObject*                                     Outer;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Offset;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioVisualEffect.CachedInstanceParameter
// 0x0020
struct FCachedInstanceParameter
{
	struct TArray<struct FInterpPropertyInfo>          OffsetInfo;                                       		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000000]              
	float                                              fCurrentValue;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bInited : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.AudioAPLStatePair
// 0x0010
struct FAudioAPLStatePair
{
	struct FName                                       m_nmAPLState;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   m_SoundCue;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VFXAPLStatePair
// 0x0009
struct FVFXAPLStatePair
{
	struct FName                                       m_nmAPLState;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_VFXState;                                       		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VisualEffectAttachment
// 0x0020
struct FVisualEffectAttachment
{
	struct TArray<struct FVFXAPLStatePair>             m_States;                                         		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UBioVFXTemplate*                             m_oEffectTemplate;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmSocket;                                       		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.StaticAttachments
// 0x0010
struct FStaticAttachments
{
	struct FName                                       BoneName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioPawn.BioGestDataCopy
// 0x004C
struct FBioGestDataCopy
{
	struct FName                                       nmPoseSet;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       nmPoseAnim;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	struct FName                                       nmGestureSet;                                     		// 0x0010 (0x0008) [0x0000000000000000]              
	struct FName                                       nmGestureAnim;                                    		// 0x0018 (0x0008) [0x0000000000000000]              
	struct FName                                       nmTransitionSet;                                  		// 0x0020 (0x0008) [0x0000000000000000]              
	struct FName                                       nmTransitionAnim;                                 		// 0x0028 (0x0008) [0x0000000000000000]              
	float                                              fPlayRate;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              fStartOffset;                                     		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              fEndOffset;                                       		// 0x0038 (0x0004) [0x0000000000000000]              
	float                                              fStartBlendDuration;                              		// 0x003C (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0040 (0x0004) [0x0000000000000000]              
	float                                              fWeight;                                          		// 0x0044 (0x0004) [0x0000000000000000]              
	unsigned long                                      bOneShotAnim : 1;                                 		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioPawn.BioGestDataKey
// 0x006C
struct FBioGestDataKey
{
	struct FBioGestureData                             tRawData;                                         		// 0x0000 (0x0060) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UBioGestChainTree*                           pChainTree;                                       		// 0x0060 (0x0008) [0x0000000000000000]              
	unsigned long                                      bUseDynamicAnimSets : 1;                          		// 0x0068 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioPawn.PawnFootStepData
// 0x0014
struct FPawnFootStepData
{
	class UBioVISFootstep*                             FootStepVIS;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                BoneIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              TimeOutRemaining;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      FootStepRequested : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioActorBehavior.BioVOSettings
// 0x0009
struct FBioVOSettings
{
	struct FColor                                      cSubtitleColour;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      bSuppressSubtitlesIfVO : 1;                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bAlert : 1;                                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned char                                      nSubtitleMode;                                    		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioActorBehavior.BioDamageReporter
// 0x001C
struct FBioDamageReporter
{
	float                                              fShieldDamage;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fShieldDamageCapacity;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fHealthDamage;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              fToxicDamage;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              fStabilityDamage;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fDamageResistance;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fToxicResistance;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioActorBehavior.BioActorBehaviorWeaponLOSCache
// 0x0038
struct FBioActorBehaviorWeaponLOSCache
{
	struct FVector                                     m_vHitTarget_Location;                            		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vHitLocation_Location;                          		// 0x000C (0x000C) [0x0000000000000000]              
	class AActor*                                      m_oHitTarget_Actor;                               		// 0x0018 (0x0008) [0x0000000000000000]              
	class AActor*                                      m_oHitLocation_Actor;                             		// 0x0020 (0x0008) [0x0000000000000000]              
	int                                                m_flags;                                          		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              m_fHitTarget_Time;                                		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              m_fHitLocation_Time;                              		// 0x0030 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bHitTarget_Result : 1;                          		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bHitLocation_Result : 1;                        		// 0x0034 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioActorBehavior.BioActorPawnBehaviorLOSCache
// 0x0010
struct FBioActorPawnBehaviorLOSCache
{
	struct TArray<struct FBioActorBehaviorWeaponLOSCache> m_WeaponLOSCaches;                                		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioInventory.BioPlotPseudoItem
// 0x0018
struct FBioPlotPseudoItem
{
	int                                                m_LocalizedName;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_LocalizedDesc;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_exportID;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_basePrice;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                m_shopGUIImageID;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                m_plotConditional;                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioGamePropertyTimer.BioGPTimingData
// 0x0011
struct FBioGPTimingData
{
	class UBioGameProperty*                            oGP;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fTime;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFrameTicked : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      eTimingType;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioGamePropertyManager.BioGamePropertyManagerTimedOutTicked
// 0x000C
struct FBioGamePropertyManagerTimedOutTicked
{
	class UBioGameProperty*                            m_pGP;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              m_fTimeRemaining;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioSquadAPI.SLocation
// 0x0010
struct FSLocation
{
	struct FVector                                     vPoint;                                           		// 0x0000 (0x000C) [0x0000000000000000]              
	int                                                nNode;                                            		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseSquad.MemberData
// 0x0073
struct FMemberData
{
	struct FCoverRecord                                stCoverToUse;                                     		// 0x0000 (0x0014) [0x0000000000000000]              
	struct FSLocation                                  EscapeLocation;                                   		// 0x0014 (0x0010) [0x0000000000000000]              
	struct FVector                                     vMoveLocation;                                    		// 0x0024 (0x000C) [0x0000000000000000]              
	struct FVector                                     vTarget;                                          		// 0x0030 (0x000C) [0x0000000000000000]              
	struct FVector                                     vHoldPosition;                                    		// 0x003C (0x000C) [0x0000000000000000]              
	class APawn*                                       SquadMember;                                      		// 0x0048 (0x0008) [0x0000000000000000]              
	class ABioTacticalMoveToIndicator*                 oDestinationIndicator;                            		// 0x0050 (0x0008) [0x0000000000000000]              
	struct FName                                       nmPower;                                          		// 0x0058 (0x0008) [0x0000000000000000]              
	class APawn*                                       oOrderedAttackTarget;                             		// 0x0060 (0x0008) [0x0000000000000000]              
	float                                              fMoveDelayTime;                                   		// 0x0068 (0x0004) [0x0000000000000000]              
	unsigned long                                      bMoveOrderAssigned : 1;                           		// 0x006C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCurrentlyMoving : 1;                             		// 0x006C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bCoverAssigned : 1;                               		// 0x006C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bActionOrderAssigned : 1;                         		// 0x006C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned char                                      eAction;                                          		// 0x0070 (0x0001) [0x0000000000000000]              
	unsigned char                                      eSwitchWeapon;                                    		// 0x0071 (0x0001) [0x0000000000000000]              
	unsigned char                                      eFormation;                                       		// 0x0072 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseSquad.PathNodeData
// 0x002D
struct FPathNodeData
{
	struct FVector                                     vPathNode;                                        		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    rRotation;                                        		// 0x000C (0x000C) [0x0000000000000000]              
	struct FRotator                                    rDirectionOfTravel;                               		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FName                                       NodeActionOn;                                     		// 0x0024 (0x0008) [0x0000000000000000]              
	unsigned char                                      NodeAction;                                       		// 0x002C (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseSquad.StrategyChoice
// 0x0010
struct FStrategyChoice
{
	struct FName                                       StateName;                                        		// 0x0000 (0x0008) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	float                                              MaxLikelihood;                                    		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CurrentLikelihood;                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseSquad.CapacityFilteringRecord
// 0x0009
struct FCapacityFilteringRecord
{
	struct FName                                       nmTechnique;                                      		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      nCapMode;                                         		// 0x0008 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct SFXGame.BioEpicPawnBehavior.EpicPawnVisualEffect
// 0x0018
struct FEpicPawnVisualEffect
{
	struct FName                                       m_nmLabel;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             m_oVFXTemplate;                                   		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmTagOfActorAtVFXLocation;                      		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioEpicPawnBehavior.BioEpicPawnBehaviorWeaponCache
// 0x0060
struct FBioEpicPawnBehaviorWeaponCache
{
	struct FVector                                     m_targetPoint;                                    		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_muzzleLocation;                                 		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     m_muzzleToTargetDisplacement;                     		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FRotator                                    m_muzzleToTargetDirection;                        		// 0x0024 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_traceHitLocation;                               		// 0x0030 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_traceHitNormal;                                 		// 0x003C (0x000C) [0x0000000000000000]              
	class ABioWeaponRanged*                            m_weapon;                                         		// 0x0048 (0x0008) [0x0000000000000000]              
	class AActor*                                      m_traceHitActor;                                  		// 0x0050 (0x0008) [0x0000000000000000]              
	int                                                m_flags;                                          		// 0x0058 (0x0004) [0x0000000000000000]              
	float                                              m_traceHitDistance;                               		// 0x005C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioEpicPawnBehavior.BioEpicPawnBehaviorCache
// 0x0010
struct FBioEpicPawnBehaviorCache
{
	struct TArray<struct FBioEpicPawnBehaviorWeaponCache> m_weaponCaches;                                   		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioPawnType.SoundSpec
// 0x0009
struct FSoundSpec
{
	class USoundCue*                                   m_oSoundCue;                                      		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_ePawnSound;                                     		// 0x0008 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioPawnType.ParticleSystemSpec
// 0x0019
struct FParticleSystemSpec
{
	struct TArray<struct FName>                        m_aBoneName;                                      		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UParticleSystem*                             m_oParticleSystem;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_ePawnParticleSystem;                            		// 0x0018 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioTalentContainer.BioTalentSpecification
// 0x004C
struct FBioTalentSpecification
{
	struct TArray<int>                                 m_PrereqTalentIDArray;                            		// 0x0000 (0x0010) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	struct TArray<int>                                 m_PrereqTalentRankArray;                          		// 0x0010 (0x0010) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	class UBioTalent*                                  m_Talent;                                         		// 0x0020 (0x0008) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	int                                                m_MaxRank;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                m_LevelOffset;                                    		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                m_LevelsPerRank;                                  		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                m_OriginalRank;                                   		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                m_VisualOrder;                                    		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                m_LocalizedName;                                  		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                m_LocalizedDesc;                                  		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                m_StringForUnlockReferences;                      		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                m_BlurbForUnlockReferences;                       		// 0x0048 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioTalentContainer.BioTalentStaticData
// 0x001C
struct FBioTalentStaticData
{
	struct FString                                     m_sUnlockDetails;                                 		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_TalentName;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                m_TalentDesc;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                m_MaxRank;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioTalentContainer.BioTalentDynamicData
// 0x0050
struct FBioTalentDynamicData
{
	struct TArray<int>                                 m_RankIconArray;                                  		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 m_RankNameArray;                                  		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 m_RankDescArray;                                  		// 0x0020 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 m_RankUnlockBlurbArray;                           		// 0x0030 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_CurrentRank;                                    		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                m_AvailableRank;                                  		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                m_MaxRank;                                        		// 0x0048 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_IsUnlocked : 1;                                 		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioTalentContainer.BioTalentDebugData
// 0x000C
struct FBioTalentDebugData
{
	int                                                m_ID;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_Rank;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_Name;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioTalentContainer.BioSimpleTalentSave
// 0x0008
struct FBioSimpleTalentSave
{
	int                                                m_TalentID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_Ranks;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioTalentContainer.BioComplexTalentSave
// 0x0038
struct FBioComplexTalentSave
{
	struct TArray<int>                                 m_PrereqTalentIDArray;                            		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 m_PrereqTalentRankArray;                          		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_TalentID;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                m_Ranks;                                          		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                m_MaxRank;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                m_LevelOffset;                                    		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                m_LevelsPerRank;                                  		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                m_VisualOrder;                                    		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioMaterialOverride.TextureParameter
// 0x0010
struct FTextureParameter
{
	struct FName                                       nName;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	class UTexture*                                    m_pTexture;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioMaterialOverride.ColorParameter
// 0x0018
struct FColorParameter
{
	struct FLinearColor                                cValue;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FName                                       nName;                                            		// 0x0010 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioMaterialOverride.ScalarParameter
// 0x000C
struct FScalarParameter
{
	struct FName                                       nName;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              sValue;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioInterface_Appearance_Pawn.CreatureSpeeds
// 0x0060
struct FCreatureSpeeds
{
	float                                              fGroundSpeed;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAirSpeed;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fWaterSpeed;                                      		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fClimbSpeed;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fWalkSpeed;                                       		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSprintSpeed;                                     		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fExploreSprintSpeed;                              		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTacticalSpeed;                                   		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTacWalkSpeed;                                    		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTacCrouchSpeed;                                  		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTacCrouchWalkSpeed;                              		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTurnSpeedHigh;                                   		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTurnSpeedLow;                                    		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTurnSpeedCombat;                                 		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTurnSpeedCombatCrouch;                           		// 0x0038 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTurnSpeedCombatSprint;                           		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fStandardFriction;                                		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAccelRate;                                       		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSAccel;                                      		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSDecel;                                      		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSAccelTac;                                   		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSDecelTac;                                   		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSAccelTacCrouch;                             		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxDSDecelTacCrouch;                             		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioInterface_Appearance_Pawn.BioPawnLabelledHeadGearBool
// 0x0005
struct FBioPawnLabelledHeadGearBool
{
	unsigned long                                      m_bIsVisible : 1;                                 		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      m_eComponent;                                     		// 0x0004 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioInterface_Appearance_Pawn.BioPawnHeadGearVisibility
// 0x001C
struct FBioPawnHeadGearVisibility
{
	struct FBioPawnLabelledHeadGearBool                m_a[ 0x3 ];                                       		// 0x0000 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bOverride : 1;                                  		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioPawnBehavior.ParticleSystemComponentSpec
// 0x0010
struct FParticleSystemComponentSpec
{
	struct TArray<class UParticleSystemComponent*>     m_aParticleSystemComponent;                       		// 0x0000 (0x0010) [0x0000000004480008]              ( CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct SFXGame.BioPawnBehavior.BioPawnBehaviorCache
// 0x000C
struct FBioPawnBehaviorCache
{
	int                                                m_flags;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_driftAngle;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_driftZoneRadius;                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioChatterSystem.ChatterLineData
// 0x0005
struct FChatterLineData
{
	float                                              TimeLastPlayed;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      SoundSet;                                         		// 0x0004 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioGestureRuntimeData.BioGestCharOverride
// 0x0048
struct FBioGestCharOverride
{
	struct FName                                       nmFemale;                                         		// 0x0000 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmAsari;                                          		// 0x0008 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmTurian;                                         		// 0x0010 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmSalarian;                                       		// 0x0018 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmQuarian;                                        		// 0x0020 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmOther;                                          		// 0x0028 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmKrogan;                                         		// 0x0030 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmGeth;                                           		// 0x0038 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FName                                       nmOtherArtificial;                                		// 0x0040 (0x0008) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioGestureRuntimeData.BioWeaponPropData
// 0x0028
struct FBioWeaponPropData
{
	struct TArray<struct FString>                      aWeaponClassPrefixes;                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FString>                      aWeaponPackages;                                  		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       nmWeaponBaseClassName;                            		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.SFXModule_AimAssistTarget.AimAssistBox
// 0x000D
struct FAimAssistBox
{
