/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGame.BioDEBUGMarker.Clear
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventClear_Parms
{
};

// Function SFXGame.BioDEBUGMarker.AddMarker
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventAddMarker_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioDEBUGMarker.AddLine
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventAddLine_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     _End;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioDEBUGMarker.Tick
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearMarkers
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearMarkers_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearCircles
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearCircles_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearDiamonds
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearDiamonds_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearArrows
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearArrows_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearLines
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearLines_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.Clear
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClear_Parms
{
};

// Function SFXGame.BioDEBUGMarkerComponent.AddCircles
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddCircles_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioDEBUGMarkerComponent.AddDiamond
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddDiamond_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioDEBUGMarkerComponent.AddMarker
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddMarker_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioDEBUGMarkerComponent.AddArrows
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddArrows_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     _End;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioDEBUGMarkerComponent.AddLine
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddLine_Parms
{
	struct FVector                                     _Start;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     _End;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioDamageType.SetDeathVFX
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execSetDeathVFX_Parms
{
	class UBioDeathVFX*                                pDeathVFX;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioDamageType.GetDeathVFX
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execGetDeathVFX_Parms
{
	class UBioDeathVFX*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioDamageType.SetAttributes
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execSetAttributes_Parms
{
	class UBioAttributesDamage*                        pAttributes;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioDamageType.GetAttributes
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execGetAttributes_Parms
{
	class UBioAttributesDamage*                        ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioDamageType.InitializeDamageType
// [0x00024400] ( FUNC_Native )
struct UBioDamageType_execInitializeDamageType_Parms
{
	class UBioAttributesDamage*                        pAttributes;                                      		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UBioDeathVFX*                                pDeathVFX;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioDestinationArrow.SetArrowColor
// [0x00020802] ( FUNC_Event )
struct ABioDestinationArrow_eventSetArrowColor_Parms
{
	unsigned char                                      clr;                                              		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// class UMaterialInstanceConstant*                MC;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioEventDispatcher.Dispatch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execDispatch_Parms
{
	struct FName                                       oEventName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioEventDispatcher.Unsubscribe
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execUnsubscribe_Parms
{
	struct FName                                       oEventName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     oSubscriber;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioEventDispatcher.Subscribe
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execSubscribe_Parms
{
	struct FName                                       oEventName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     oSubscriber;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGameReplicationInfo.PostBeginPlay
// [0x00020102] 
struct ABioGameReplicationInfo_execPostBeginPlay_Parms
{
};

// Function SFXGame.BioGamerProfile.UpdateRichPresence
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateRichPresence_Parms
{
};

// Function SFXGame.BioGamerProfile.UpdateSoundOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateSoundOptions_Parms
{
};

// Function SFXGame.BioGamerProfile.ApplyGraphicsOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execApplyGraphicsOptions_Parms
{
	struct FGameOptions                                Options;                                          		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.UpdateGraphicsOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateGraphicsOptions_Parms
{
};

// Function SFXGame.BioGamerProfile.UpdateAllOptions
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAllOptions_Parms
{
	unsigned long                                      bUpdateRichPresence;                              		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioGamerProfile.DuplicateGameOptions
// [0x00420802] ( FUNC_Event )
struct UBioGamerProfile_eventDuplicateGameOptions_Parms
{
	struct FGameOptions                                destOptions;                                      		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function SFXGame.BioGamerProfile.OverwiteGameOptions
// [0x00024802] ( FUNC_Event )
struct UBioGamerProfile_eventOverwiteGameOptions_Parms
{
	struct FGameOptions                                sourceOptions;                                    		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdateRichPresence;                              		// 0x00B0 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetTargetingAssistModifier
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetTargetingAssistModifier_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetOptionEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetOptionEx_Parms
{
	struct FGameOptions                                io_oGameOptions;                                  		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionType;                                    		// 0x00B0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x00B4 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function SFXGame.BioGamerProfile.GetOption
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetOption_Parms
{
	int                                                i_nOptionType;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function SFXGame.BioGamerProfile.SetOptionEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execSetOptionEx_Parms
{
	struct FGameOptions                                io_oGameOptions;                                  		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                i_nOptionType;                                    		// 0x00B0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x00B4 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bSuppressUpdate;                                		// 0x00B8 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.SetOption
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetOption_Parms
{
	int                                                i_nOptionType;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bSuppressUpdate;                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetCombatDifficulty
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCombatDifficulty_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetCombatDifficulty
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetCombatDifficulty_Parms
{
	int                                                i_Template;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.DumpAchievementStats
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execDumpAchievementStats_Parms
{
};

// Function SFXGame.BioGamerProfile.GetGammaPostProcessTemplate
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetGammaPostProcessTemplate_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetGammaPostProcessTemplate
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetGammaPostProcessTemplate_Parms
{
	int                                                i_Template;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.SelectDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSelectDefaultStorageDevice_Parms
{
};

// Function SFXGame.BioGamerProfile.GetDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetDefaultStorageDevice_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetDefaultStorageDevice_Parms
{
	int                                                i_DeviceId;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetBioProfileStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetBioProfileStorageDevice_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetBioProfileStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetBioProfileStorageDevice_Parms
{
	int                                                i_DeviceId;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.SetYAxisInverted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetYAxisInverted_Parms
{
	unsigned long                                      bInverted;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetYAxisInverted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetYAxisInverted_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetAllUnlockedBonusTalentInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetAllUnlockedBonusTalentInfo_Parms
{
	struct TArray<struct FUnlockedBonusTalentInfo>     aUnlockedBonusTalentInfo;                         		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FName                                       nmCharClass;                                      		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.AwardAllPassiveBonusTalents
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execAwardAllPassiveBonusTalents_Parms
{
};

// Function SFXGame.BioGamerProfile.UpdateAchievementState
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAchievementState_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bEarned;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdatePlotState;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAwardBonusTalent;                                		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSaveProfile;                                     		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetDefaultValues
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetDefaultValues_Parms
{
	struct FGameOptions                                io_Options;                                       		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function SFXGame.BioGamerProfile.ResetToDefaults
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execResetToDefaults_Parms
{
	unsigned long                                      bUpdateRichPresence;                              		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioGamerProfile.SortAchievementInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execSortAchievementInfo_Parms
{
	struct TArray<struct FAchievementInfo>             aAchievementList;                                 		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.GetAllAchievementInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetAllAchievementInfo_Parms
{
	struct TArray<struct FAchievementInfo>             aAchievementList;                                 		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.GetAchievementID
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetIsAchievementEarned
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIsAchievementEarned_Parms
{
	int                                                AchievementId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.UpdateAchievements
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAchievements_Parms
{
	struct TArray<struct FAchievementDetails>          Achievements;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class ABioPlayerController*                        PC;                                               		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioGamerProfile.UpdateCharacterProfilePawnDataEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateCharacterProfilePawnDataEx_Parms
{
	struct FCharacterProfile                           sCharProfile;                                     		// 0x0000 (0x00BC) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class ABioPawn*                                    i_playerPawn;                                     		// 0x00BC (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bUpdateFirstName;                               		// 0x00C4 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oHoursPlayed;                                   		// 0x00C8 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oMinPlayed;                                     		// 0x00CC (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oSecPlayed;                                     		// 0x00D0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x00D4 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.UpdateCharacterProfilePawnData
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateCharacterProfilePawnData_Parms
{
	struct FString                                     sCharacterID;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class ABioPawn*                                    i_playerPawn;                                     		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oHoursPlayed;                                   		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oMinPlayed;                                     		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oSecPlayed;                                     		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bUpdateFirstName;                               		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.DeleteCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execDeleteCharacterProfile_Parms
{
	struct FString                                     sCharacterID;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetCharacterProfileIndex
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCharacterProfileIndex_Parms
{
	struct FString                                     sCharacterID;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetCharacterProfile
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execSetCharacterProfile_Parms
{
	struct FString                                     sCharacterID;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FCharacterProfile                           i_CharProfile;                                    		// 0x0010 (0x00BC) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      i_bAddProfileIfNotExist;                          		// 0x00CC (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioGamerProfile.GetCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCharacterProfile_Parms
{
	struct FString                                     sCharacterID;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FCharacterProfile                           ReturnValue;                                      		// 0x0010 (0x00BC) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.SetCharacterProfileLastPlayedSlot
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetCharacterProfileLastPlayedSlot_Parms
{
	struct FString                                     sCharacaterID;                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nLastPlayedSlot;                                  		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.ConvertToValidCharacterID
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execConvertToValidCharacterID_Parms
{
	struct FString                                     sCharacterName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bConvertAccentCharacters;                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.CreateNewCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execCreateNewCharacterProfile_Parms
{
	struct FString                                     sCharacterName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.SetFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fValue;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.InrementFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execInrementFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAmount;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nValue;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.IncrementIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execIncrementIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nAmount;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetHighestDifficultyCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetHighestDifficultyCompleted_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetPlaythroughCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetPlaythroughCompleted_Parms
{
	int                                                nDifficulty;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetNumberOfPlaythroughsCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetNumberOfPlaythroughsCompleted_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.UpdateEndGameGamerProfileStats
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateEndGameGamerProfileStats_Parms
{
	unsigned long                                      bLogStats;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetUnlockedTalentTrees
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetUnlockedTalentTrees_Parms
{
	struct TArray<int>                                 aUnlockedTalentTrees;                             		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.GetRewardStatUnlockedAt
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetRewardStatUnlockedAt_Parms
{
	struct FString                                     sStatisticName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.GetRewardStatName
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetRewardStatName_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioGamerProfile.GetIsRewardStatUnlocked
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIsRewardStatUnlocked_Parms
{
	struct FString                                     sStatisticName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.IncrementRewardStat
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execIncrementRewardStat_Parms
{
	struct FString                                     sStatisticName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nAmount;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetRewardStat
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetRewardStat_Parms
{
	struct FString                                     sStatisticName;                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nValue;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.RestoreGamerProfilePlotManagerVariables
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execRestoreGamerProfilePlotManagerVariables_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioGamerProfile.SetGamerProfilePlotManagerVariables
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetGamerProfilePlotManagerVariables_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioObject.ValidateOwnershipSemantics
// [0x00026400] ( FUNC_Native )
struct UBioObject_execValidateOwnershipSemantics_Parms
{
	class UObject*                                     Target;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      isVerbose;                                        		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                recurrence;                                       		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioObject.ParseIntoArray
// [0x00422400] ( FUNC_Native )
struct UBioObject_execParseIntoArray_Parms
{
	struct TArray<struct FString>                      aString;                                          		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     sDelimitedStrings;                                		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sDelimiter;                                       		// 0x0020 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bCullEmptyStrings;                                		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioObject.ParseIntoArrayWS
// [0x00422400] ( FUNC_Native )
struct UBioObject_execParseIntoArrayWS_Parms
{
	struct FString                                     whitespaceDelimitedStrings;                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct TArray<struct FString>                      Strings;                                          		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioObject.GetEnumValue
// [0x00422400] ( FUNC_Native )
struct UBioObject_execGetEnumValue_Parms
{
	class UClass*                                      clsEnumDefiner;                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmEnumField;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmEnumValue;                                      		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      cEnumValue;                                       		// 0x0018 (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioObject.FindClass
// [0x00022400] ( FUNC_Native )
struct UBioObject_execFindClass_Parms
{
	struct FName                                       nmClass;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.RequestSound
// [0x00420400] ( FUNC_Native )
struct UBioPhysicsSounds_execRequestSound_Parms
{
	int                                                nPriority;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         oComp0;                                           		// 0x0004 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         oComp1;                                           		// 0x000C (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct TArray<struct FRigidBodyContactInfo>        ContactInfos;                                     		// 0x0014 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.Initialize
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execInitialize_Parms
{
};

// Function SFXGame.BioPowerScript.PlayForceFeedback
// [0x00020400] ( FUNC_Native )
struct UBioPowerScript_execPlayForceFeedback_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.PlayGuiSound
// [0x00020400] ( FUNC_Native )
struct UBioPowerScript_execPlayGuiSound_Parms
{
	struct FName                                       nmSound;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.GetFloorLocation
// [0x00420400] ( FUNC_Native )
struct UBioPowerScript_execGetFloorLocation_Parms
{
	struct FVector                                     vStartLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     vFloorLocation;                                   		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.AdjustCooldown
// [0x00420802] ( FUNC_Event )
struct UBioPowerScript_eventAdjustCooldown_Parms
{
	float                                              fCoolDownTime;                                    		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.OnImpact
// [0x00020802] ( FUNC_Event )
struct UBioPowerScript_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.EndPhase
// [0x00020802] ( FUNC_Event )
struct UBioPowerScript_eventEndPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.StartPhase
// [0x00020802] ( FUNC_Event )
struct UBioPowerScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.CanStartPower
// [0x00020802] ( FUNC_Event )
struct UBioPowerScript_eventCanStartPower_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPowerScript.InitializePowerScript
// [0x00020802] ( FUNC_Event )
struct UBioPowerScript_eventInitializePowerScript_Parms
{
	class UBioPower*                                   pPower;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioSeqAct_PopupLootGui.Activated
// [0x00020802] ( FUNC_Event )
struct UBioSeqAct_PopupLootGui_eventActivated_Parms
{
	// class ABioWorldInfo*                            oWorldInfo;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     oController;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
	// int                                             nPlayerLevel;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	// class UBioInventory*                            oPlayerInventory;                                 		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UBioInventory*                            oLoot;                                            		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioTriggerStream.UnTouch
// [0x00020802] ( FUNC_Event )
struct ABioTriggerStream_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class ABioPawn*                                 oBioPawn;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// class APawn*                                    P;                                                		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioTriggerStream.Touch
// [0x00020802] ( FUNC_Event )
struct ABioTriggerStream_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class APawn*                                    P;                                                		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioTriggerStream.ForegroundStreamingDone
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execForegroundStreamingDone_Parms
{
	struct TArray<class USequence*>                    Sequences;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class APawn*                                       PlayerPawn;                                       		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioTriggerStream.BackgroundStreamingDone
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execBackgroundStreamingDone_Parms
{
	struct TArray<class USequence*>                    Sequences;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class APawn*                                       PlayerPawn;                                       		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioTriggerStream.Retouch
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execRetouch_Parms
{
};

// Function SFXGame.BioTriggerStream.DoStasis
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execDoStasis_Parms
{
	class AActor*                                      Touched;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTouched;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioTriggerStream.DoUntouch
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execDoUntouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioTriggerStream.DoTouch
// [0x00020400] ( FUNC_Native )
struct ABioTriggerStream_execDoTouch_Parms
{
};

// Function SFXGame.SFXDifficultyHandler.Update
// [0x00020002] 
struct USFXDifficultyHandler_execUpdate_Parms
{
	// class ABioPlayerSquad*                          PlayerSquad;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

