/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_RETICLE_MIN_AR                                     0.05f
#define CONST_GP_NEVER_TIMEOUT                                   9999999999.0f
#define CONST_ZONE_VALID_DELAY_TIME                              0.25f
#define CONST_BIO_SQUAD_MARK_TOLERANCE                           30.0
#define CONST_BIO_SQUAD_MARK_TOLERANCE_SQ                        900.0
#define CONST_BIO_SQUAD_HOLDVELOCITY                             50.0

	GameDataType_Load                                  = 0,
	GameDataType_Save                                  = 1,
	GameDataType_AutoSave                              = 2,
	GameDataType_ChapterSave                           = 3,
	GameDataType_EndGame                               = 4,
	GameDataType_Unknown                               = 5,
	GameDataType_MAX                                   = 6
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLogoutReason
/*enum ETelemetryLogoutReason
{
	LogoutStatus_Normal                                = 0,
	LogoutStatus_Error                                 = 1,
	LogoutStatus_OptOutTelemetry                       = 2,
	LogoutStatus_Unknown                               = 3,
	LogoutStatus_MAX                                   = 4
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLoginStatus
/*enum ETelemetryLoginStatus
{
	LoginStatus_Success                                = 0,
	LoginStatus_Error                                  = 1,
	LoginStatus_Cancel                                 = 2,
	LoginStatus_Unknown                                = 3,
	LoginStatus_MAX                                    = 4
};*/

// Enum SFXGame.SFXTelemetry.EBootEndReason
/*enum EBootEndReason
{
	BootEndReason_Normal                               = 0,
	BootEndReason_Error                                = 1,
	BootEndReason_OptOutTelemetry                      = 2,
	BootEndReason_Unknown                              = 3,
	BootEndReason_MAX                                  = 4
};*/

// Enum SFXGame.SFXTelemetryGameSession.EGameEndReason
/*enum EGameEndReason
{
	GameEndReason_Leave                                = 0,
	GameEndReason_GameEnd                              = 1,
	GameEndReason_Restart                              = 2,
	GameEndReason_Error                                = 3,
	GameEndReason_OptOutTelemetry                      = 4,
	GameEndReason_Unknown                              = 5,
	GameEndReason_MAX                                  = 6
};*/

// Enum SFXGame.SFXWeaponStatsBase.FireModes
/*enum FireModes
{
	FireMode_None                                      = 0,
	FireMode_SemiAuto                                  = 1,
	FireMode_FullAuto                                  = 2,
	FireMode_Burst                                     = 3,
	FireMode_Ramping                                   = 4,
	FireMode_MAX                                       = 5
};*/

// Enum SFXGame.UnVince.EBioTestSeverity
/*enum EBioTestSeverity
{
	BIOSEVERITY_FATAL                                  = 0,
	BIOSEVERITY_ERROR                                  = 1,
	BIOSEVERITY_WARNING                                = 2,
	BIOSEVERITY_INFORMATION                            = 3,
	BIOSEVERITY_MAX                                    = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGame.BioActorFactoryPhysicsActor
// 0x0003 (0x00D4 - 0x00D1)
class UBioActorFactoryPhysicsActor : public UActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioAppearanceVehicleSettings
// 0x0004 (0x0074 - 0x0070)
class UBioAppearanceVehicleSettings : public UComponent
{
public:
	int                                                m_nMaterialConfig;                                		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioCoverVolume
// 0x0000 (0x02C4 - 0x02C4)
class ABioCoverVolume : public AVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioDEBUGMarker
// 0x000C (0x0290 - 0x0284)
class ABioDEBUGMarker : public AActor
{
public:
	class UBioDEBUGMarkerComponent*                    Markers;                                          		// 0x0284 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              TimeTillDestroy;                                  		// 0x028C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventClear ( );
	void eventAddMarker ( struct FVector _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventAddLine ( struct FVector _Start, struct FVector _End, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventTick ( float DeltaTime );
};

// Class SFXGame.BioDEBUGMarkerComponent
// 0x0050 (0x0270 - 0x0220)
class UBioDEBUGMarkerComponent : public UPrimitiveComponent
{
public:
	struct TArray<struct FLineData>                    Lines;                                            		// 0x0220 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FLineData>                    Arrows;                                           		// 0x0230 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FMarkerData>                  Markers;                                          		// 0x0240 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FMarkerData>                  Diamonds;                                         		// 0x0250 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FMarkerData>                  Circles;                                          		// 0x0260 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventClearMarkers ( );
	void eventClearCircles ( );
	void eventClearDiamonds ( );
	void eventClearArrows ( );
	void eventClearLines ( );
	void eventClear ( );
	void eventAddCircles ( struct FVector _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventAddDiamond ( struct FVector _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventAddMarker ( struct FVector _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventAddArrows ( struct FVector _Start, struct FVector _End, unsigned char _R, unsigned char _G, unsigned char _B );
	void eventAddLine ( struct FVector _Start, struct FVector _End, unsigned char _R, unsigned char _G, unsigned char _B );
};

// Class SFXGame.BioDamageType
// 0x0014 (0x00D4 - 0x00C0)
class UBioDamageType : public UDamageType
{
public:
	class UBioDeathVFX*                                m_pDeathVFX;                                      		// 0x00C0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBioAttributesDamage*                        m_pAttributes;                                    		// 0x00C8 (0x0008) [0x0000000004420009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline )
	unsigned long                                      m_bIsInitialized : 1;                             		// 0x00D0 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void SetDeathVFX ( class UBioDeathVFX* pDeathVFX );
	class UBioDeathVFX* GetDeathVFX ( );
	void SetAttributes ( class UBioAttributesDamage* pAttributes );
	class UBioAttributesDamage* GetAttributes ( );
	void InitializeDamageType ( class UBioAttributesDamage* pAttributes, class UBioDeathVFX* pDeathVFX );
};

// Class SFXGame.BioDestinationArrow
// 0x0008 (0x028C - 0x0284)
class ABioDestinationArrow : public AActor
{
public:
	class USkeletalMeshComponent*                      Mesh;                                             		// 0x0284 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventSetArrowColor ( unsigned char clr );
};

// Class SFXGame.BioEventDispatcher
// 0x0048 (0x00A8 - 0x0060)
class UBioEventDispatcher : public UObject
{
public:
	struct FMap_Mirror                                 m_mEventSubscriptions;                            		// 0x0060 (0x0048) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void Dispatch ( struct FName oEventName );
	bool Unsubscribe ( struct FName oEventName, class UObject* oSubscriber );
	bool Subscribe ( struct FName oEventName, class UObject* oSubscriber );
};

// Class SFXGame.BioFollowMarker
// 0x0000 (0x0284 - 0x0284)
class ABioFollowMarker : public AActor
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioGameReplicationInfo
// 0x0014 (0x0318 - 0x0304)
class ABioGameReplicationInfo : public AGameReplicationInfo
{
public:
	class UClass*                                      DifficultyHandlerClass;                           		// 0x0304 (0x0008) [0x0000000000000002]              ( CPF_Const )
	class USFXDifficultyHandler*                       DifficultyHandler;                                		// 0x030C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Temp : 1;                                         		// 0x0314 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void PostBeginPlay ( );
};

// Class SFXGame.BioGamerProfile
// 0x02A0 (0x0300 - 0x0060)
class UBioGamerProfile : public UObject
{
public:
	struct TArray<struct FProfileBOOL>                 BoolVariables;                                    		// 0x0060 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FProfileINT>                  IntVariables;                                     		// 0x0070 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FProfileFLOAT>                FloatVariables;                                   		// 0x0080 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FPlotManagerAchievement>      PlotManagerAchievementMaps;                       		// 0x0090 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FProfilePlaythrough>          lstPlaythroughs;                                  		// 0x00A0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FProfileRewardStat>           RewardStats;                                      		// 0x00B0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 anAchievementStates;                              		// 0x00C0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBonusTalent>                 aUnlockedBonusTalents;                            		// 0x00D0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBonusTalent>                 BonusWeaponTalents;                               		// 0x00E0 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FBonusTalent>                 aPassiveBonusTalents;                             		// 0x00F0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<int>                                 IntStats;                                         		// 0x0100 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<float>                               FloatStats;                                       		// 0x0110 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FCharacterProfile>            lstCharacterProfiles;                             		// 0x0120 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sLastPlayedCharacterID;                         		// 0x0130 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sLastSaveGame;                                  		// 0x0140 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<unsigned char>                       KeyBindings;                                      		// 0x0150 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FGameOptions                                m_GameOptions;                                    		// 0x0160 (0x00B0) [0x0000000000000000]              
	struct FName                                       m_nmSKU;                                          		// 0x0210 (0x0008) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	class UBio2DA*                                     RewardsTable;                                     		// 0x0218 (0x0008) [0x0000000000000000]              
	int                                                m_DefaultGammaPostProcessTemplate;                		// 0x0220 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultCombatDifficulty;                       		// 0x0224 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultDialogMode;                             		// 0x0228 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoLevelUp;                            		// 0x022C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nLegacyLevelUpMode;                             		// 0x0230 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoEquip;                              		// 0x0234 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultTutorialFlag;                           		// 0x0238 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultSubTitles;                              		// 0x023C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoPauseEnemySighted;                  		// 0x0240 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoPauseSquadMemberDown;               		// 0x0244 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultMusicVolume;                            		// 0x0248 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultFXVolume;                               		// 0x024C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultDialogVolume;                           		// 0x0250 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultSouthpawFlag;                           		// 0x0254 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultTargetingAssistMode;                    		// 0x0258 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	float                                              m_nDefaultTargetingAssistModifierHigh;            		// 0x025C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	float                                              m_nDefaultTargetingAssistModifierNormal;          		// 0x0260 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	float                                              m_nDefaultTargetingAssistModifierLow;             		// 0x0264 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultHorizontalCombatSensitivity;            		// 0x0268 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultVerticalCombatSensitivity;              		// 0x026C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultHorizontalExplorationSensitivity;       		// 0x0270 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultVerticalExplorationSensitivity;         		// 0x0274 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultControllerSensativityLow;               		// 0x0278 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultControllerSensativityMedium;            		// 0x027C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultControllerSensativityHigh;              		// 0x0280 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultRumbleFlag;                             		// 0x0284 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoPauseBleedOut;                      		// 0x0288 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultMotionBlur;                             		// 0x028C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultFilmGrain;                              		// 0x0290 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultSquadPowerUse;                          		// 0x0294 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAutoSave;                               		// 0x0298 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAntiAliasing;                           		// 0x029C (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultTextureDetailLevel;                     		// 0x02A0 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultDynamicResolution;                      		// 0x02A4 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultAmbientOcclusion;                       		// 0x02A8 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultBrightness;                             		// 0x02AC (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultHDRBrightness;                          		// 0x02B0 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultHDRContrast;                            		// 0x02B4 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nAchievedCombatDifficultyOverride;              		// 0x02B8 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultStickConfiguration;                     		// 0x02BC (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultTriggerConfiguration;                   		// 0x02C0 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                ParagonPlotIndex;                                 		// 0x02C4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                RenegadePlotIndex;                                		// 0x02C8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                PrincipledAchievementThreshold;                   		// 0x02CC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nDefaultMouseSensitivity;                       		// 0x02D0 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultSensePerc;                              		// 0x02D4 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_bDefaultMonitorIndex;                           		// 0x02D8 (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nDefaultFramerateIndex;                         		// 0x02DC (0x0004) [0x0000000000006000]              ( CPF_Transient | CPF_Config )
	int                                                m_nLastUsedPlaythroughID;                         		// 0x02E0 (0x0004) [0x0000000000000000]              
	int                                                m_nMostMoneyAccumulated;                          		// 0x02E4 (0x0004) [0x0000000000000000]              
	int                                                m_nMostPlaythroughPlayerKills;                    		// 0x02E8 (0x0004) [0x0000000000000000]              
	int                                                m_nLowestPlaythroughPlayerDeaths;                 		// 0x02EC (0x0004) [0x0000000000000000]              
	float                                              m_fFastestPlaythroughTime;                        		// 0x02F0 (0x0004) [0x0000000000000000]              
	int                                                m_DefaultSaveDeviceId;                            		// 0x02F4 (0x0004) [0x0000000000000000]              
	int                                                m_BioProfileSaveDeviceId;                         		// 0x02F8 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bDefaultYAxisInverted : 1;                      		// 0x02FC (0x0004) [0x0000000000006000] [0x00000001] ( CPF_Transient | CPF_Config )
	unsigned long                                      m_bDefaultVsync : 1;                              		// 0x02FC (0x0004) [0x0000000000006000] [0x00000002] ( CPF_Transient | CPF_Config )
	unsigned long                                      m_bDefaultShadowDetailLevel : 1;                  		// 0x02FC (0x0004) [0x0000000000006000] [0x00000004] ( CPF_Transient | CPF_Config )
	unsigned long                                      m_bDefaultHDREnable : 1;                          		// 0x02FC (0x0004) [0x0000000000006000] [0x00000008] ( CPF_Transient | CPF_Config )
	unsigned long                                      m_bDefaultCameraRelativeSteering : 1;             		// 0x02FC (0x0004) [0x0000000000006000] [0x00000010] ( CPF_Transient | CPF_Config )
	unsigned long                                      m_bInvalidProfileCreator : 1;                     		// 0x02FC (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_bGamerProfileDeviceHasBeenRemoved : 1;          		// 0x02FC (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void UpdateRichPresence ( );
	void UpdateSoundOptions ( );
	void ApplyGraphicsOptions ( struct FGameOptions Options );
	void UpdateGraphicsOptions ( );
	void UpdateAllOptions ( unsigned long bUpdateRichPresence );
	void eventDuplicateGameOptions ( struct FGameOptions* destOptions );
	void eventOverwiteGameOptions ( struct FGameOptions sourceOptions, unsigned long bUpdateRichPresence );
	float GetTargetingAssistModifier ( );
	void GetOptionEx ( struct FGameOptions io_oGameOptions, int i_nOptionType, int* i_nOptionValue );
	void GetOption ( int i_nOptionType, int* i_nOptionValue );
	void SetOptionEx ( int i_nOptionType, int i_nOptionValue, unsigned long i_bSuppressUpdate, struct FGameOptions* io_oGameOptions );
	void SetOption ( int i_nOptionType, int i_nOptionValue, unsigned long i_bSuppressUpdate );
	int GetCombatDifficulty ( );
	void SetCombatDifficulty ( int i_Template );
	void DumpAchievementStats ( );
	int GetGammaPostProcessTemplate ( );
	void SetGammaPostProcessTemplate ( int i_Template );
	void SelectDefaultStorageDevice ( );
	int GetDefaultStorageDevice ( );
	void SetDefaultStorageDevice ( int i_DeviceId );
	int GetBioProfileStorageDevice ( );
	void SetBioProfileStorageDevice ( int i_DeviceId );
	void SetYAxisInverted ( unsigned long bInverted );
	bool GetYAxisInverted ( );
	void GetAllUnlockedBonusTalentInfo ( struct FName nmCharClass, struct TArray<struct FUnlockedBonusTalentInfo>* aUnlockedBonusTalentInfo );
	void AwardAllPassiveBonusTalents ( );
	void UpdateAchievementState ( int nAchievementID, unsigned long bEarned, unsigned long bUpdatePlotState, unsigned long bAwardBonusTalent, unsigned long bSaveProfile );
	void GetDefaultValues ( struct FGameOptions* io_Options );
	void ResetToDefaults ( unsigned long bUpdateRichPresence );
	void SortAchievementInfo ( struct TArray<struct FAchievementInfo>* aAchievementList );
	void GetAllAchievementInfo ( struct TArray<struct FAchievementInfo>* aAchievementList );
	int GetAchievementID ( int Index );
	bool GetIsAchievementEarned ( int AchievementId );
	void UpdateAchievements ( struct TArray<struct FAchievementDetails> Achievements, class ABioPlayerController* PC );
	bool UpdateCharacterProfilePawnDataEx ( class ABioPawn* i_playerPawn, unsigned long i_bUpdateFirstName, int i_oHoursPlayed, int i_oMinPlayed, int i_oSecPlayed, struct FCharacterProfile* sCharProfile );
	bool UpdateCharacterProfilePawnData ( struct FString sCharacterID, class ABioPawn* i_playerPawn, int i_oHoursPlayed, int i_oMinPlayed, int i_oSecPlayed, unsigned long i_bUpdateFirstName );
	bool DeleteCharacterProfile ( struct FString sCharacterID );
	int GetCharacterProfileIndex ( struct FString sCharacterID );
	void SetCharacterProfile ( struct FString sCharacterID, struct FCharacterProfile i_CharProfile, unsigned long i_bAddProfileIfNotExist );
	struct FCharacterProfile GetCharacterProfile ( struct FString sCharacterID );
	bool SetCharacterProfileLastPlayedSlot ( struct FString sCharacaterID, int nLastPlayedSlot );
	struct FString ConvertToValidCharacterID ( struct FString sCharacterName, unsigned long bConvertAccentCharacters );
	struct FString CreateNewCharacterProfile ( struct FString sCharacterName );
	bool SetFloatStatistic ( int nIndex, float fValue );
	float InrementFloatStatistic ( int nIndex, float fAmount );
	float GetFloatStatistic ( int nIndex );
	bool SetIntStatistic ( int nIndex, int nValue );
	int IncrementIntStatistic ( int nIndex, int nAmount );
	int GetIntStatistic ( int nIndex );
	int GetHighestDifficultyCompleted ( );
	bool GetPlaythroughCompleted ( int nDifficulty );
	int GetNumberOfPlaythroughsCompleted ( );
	bool UpdateEndGameGamerProfileStats ( unsigned long bLogStats );
	void GetUnlockedTalentTrees ( struct TArray<int>* aUnlockedTalentTrees );
	int GetRewardStatUnlockedAt ( struct FString sStatisticName );
	struct FString GetRewardStatName ( int nAchievementID );
	bool GetIsRewardStatUnlocked ( struct FString sStatisticName );
	int IncrementRewardStat ( struct FString sStatisticName, int nAmount );
	bool SetRewardStat ( struct FString sStatisticName, int nValue );
	bool RestoreGamerProfilePlotManagerVariables ( );
	bool SetGamerProfilePlotManagerVariables ( );
};

// Class SFXGame.BioLayers
// 0x0028 (0x0094 - 0x006C)
class UBioLayers : public UBioBaseComponent
{
public:
	float                                              m_aEntry[ 0xA ];                                  		// 0x006C (0x0028) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioLoadingMovie
// 0x0014 (0x0074 - 0x0060)
class UBioLoadingMovie : public UObject
{
public:
	struct FString                                     MovieName;                                        		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                LoopBackFrame;                                    		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioObject
// 0x0048 (0x00B4 - 0x006C)
class UBioObject : public UBioBaseComponent
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x006C (0x0048) UNKNOWN PROPERTY: MapProperty SFXGame.BioObject.m_ClassCache

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool ValidateOwnershipSemantics ( class UObject* Target, unsigned long isVerbose, int recurrence );
	void ParseIntoArray ( struct FString sDelimitedStrings, struct FString sDelimiter, unsigned long bCullEmptyStrings, struct TArray<struct FString>* aString );
	void ParseIntoArrayWS ( struct FString whitespaceDelimitedStrings, struct TArray<struct FString>* Strings );
	bool GetEnumValue ( class UClass* clsEnumDefiner, struct FName nmEnumField, struct FName nmEnumValue, unsigned char* cEnumValue );
	class UClass* FindClass ( struct FName nmClass );
};

// Class SFXGame.BioPathNodeVolume
// 0x001E (0x02E2 - 0x02C4)
class ABioPathNodeVolume : public AVolume
{
public:
	float                                              fMaxNodeSeparation;                               		// 0x02C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMargin;                                          		// 0x02C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fNodeTargetRadius;                                		// 0x02CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxSlope;                                        		// 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nLevels;                                          		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fLevelHeight;                                     		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bDeleteNodesOnPopulate : 1;                       		// 0x02DC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bDoNotGenerateGroundNodes : 1;                    		// 0x02DC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned char                                      eAlignment;                                       		// 0x02E0 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ePathNodeGenerator;                               		// 0x02E1 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioPhysicsSounds
// 0x0034 (0x0094 - 0x0060)
class UBioPhysicsSounds : public UObject
{
public:
	struct FString                                     m_sPhysicsSoundEntity;                            		// 0x0060 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FBioPhysicsSoundsInfo>        m_aAudioTracks;                                   		// 0x0070 (0x0010) [0x0000000000482000]              ( CPF_Transient | CPF_Component | CPF_NeedCtorLink )
	float                                              m_fMaxMass;                                       		// 0x0080 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMaxSpeed;                                      		// 0x0084 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinTimeBetweenSoundByActor;                    		// 0x0088 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                m_nMaxSimultaneousSounds;                         		// 0x008C (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bPhysicsSoundDebug : 1;                         		// 0x0090 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool RequestSound ( int nPriority, class UPrimitiveComponent* oComp0, class UPrimitiveComponent* oComp1, struct TArray<struct FRigidBodyContactInfo>* ContactInfos );
	void Initialize ( );
};

// Class SFXGame.BioPowerScript
// 0x0020 (0x0080 - 0x0060)
class UBioPowerScript : public UObject
{
public:
	struct FVector                                     m_vWorldImpactLocation;                           		// 0x0060 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vWorldImpactNormal;                             		// 0x006C (0x000C) [0x0000000000000000]              
	class UBioPower*                                   m_oPower;                                         		// 0x0078 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool PlayForceFeedback ( class AActor* oCaster, class AActor* oImpacted );
	bool PlayGuiSound ( struct FName nmSound );
	bool GetFloorLocation ( struct FVector vStartLocation, struct FVector* vFloorLocation );
	bool eventAdjustCooldown ( float* fCoolDownTime );
	bool eventOnImpact ( class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted );
	bool eventEndPhase ( unsigned char ePhase, class AActor* oCaster );
	bool eventStartPhase ( unsigned char ePhase, class AActor* oCaster, float fDuration );
	bool eventCanStartPower ( class AActor* oCaster );
	void eventInitializePowerScript ( class UBioPower* pPower );
};

// Class SFXGame.BioRadarMapBoundaries
// 0x000C (0x0290 - 0x0284)
class ABioRadarMapBoundaries : public AActor
{
public:
	struct FVector                                     m_vBoundarySize;                                  		// 0x0284 (0x000C) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSeqAct_PopupLootGui
// 0x000C (0x0104 - 0x00F8)
class UBioSeqAct_PopupLootGui : public USequenceAction
{
public:
	int                                                m_nTreasureID;                                    		// 0x00F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nOverrideLevel;                                 		// 0x00FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bSupressLootGui : 1;                            		// 0x0100 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventActivated ( );
};

// Class SFXGame.BioSocketSupermodel
// 0x0010 (0x0434 - 0x0424)
class UBioSocketSupermodel : public USkeletalMesh
{
public:
	struct TArray<class USkeletalMesh*>                Dependents;                                       		// 0x0424 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSpriteTranslucentComponent
// 0x0034 (0x0274 - 0x0240)
class UBioSpriteTranslucentComponent : public USpriteComponent
{
public:
	struct FLinearColor                                CachedColor;                                      		// 0x0240 (0x0010) [0x0000000000002000]              ( CPF_Transient )
	float                                              TranslucentScale;                                 		// 0x0250 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fDelayTime;                                       		// 0x0254 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fFadeInTime;                                      		// 0x0258 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fDuration;                                        		// 0x025C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fFadeOutTime;                                     		// 0x0260 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fIntensityCurveAccumulator;                       		// 0x0264 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fScaleCurveAccumulator;                           		// 0x0268 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fBrightnessCurveAccumulator;                      		// 0x026C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bRenderOcclusionOnly : 1;                         		// 0x0270 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIsOccluder : 1;                                  		// 0x0270 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSunFlareComponent
// 0x0020 (0x0294 - 0x0274)
class UBioSunFlareComponent : public UBioSpriteTranslucentComponent
{
public:
	struct FLinearColor                                FlareTint;                                        		// 0x0274 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              Intensity;                                        		// 0x0284 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Distance;                                         		// 0x0288 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BrightPercent;                                    		// 0x028C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      UseParentOverrideTint : 1;                        		// 0x0290 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      IsHaloComponent : 1;                              		// 0x0290 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSunFlareStreakComponent
// 0x0030 (0x02A4 - 0x0274)
class UBioSunFlareStreakComponent : public UBioSpriteTranslucentComponent
{
public:
	struct FLinearColor                                FlareTint;                                        		// 0x0274 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              Intensity;                                        		// 0x0284 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Distance;                                         		// 0x0288 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HorizontalOffset;                                 		// 0x028C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HorizontalMoveRate;                               		// 0x0290 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VerticalOffset;                                   		// 0x0294 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VerticalMoveRate;                                 		// 0x0298 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BrightPercent;                                    		// 0x029C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      UseParentOverrideTint : 1;                        		// 0x02A0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      IsHaloComponent : 1;                              		// 0x02A0 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSunActor
// 0x012C (0x03B0 - 0x0284)
class ABioSunActor : public AActor
{
public:
	struct FRawDistributionFloat                       IntensityCurve;                                   		// 0x0284 (0x0024) [0x00000000044A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	struct FRawDistributionFloat                       ScaleCurve;                                       		// 0x02A8 (0x0024) [0x00000000044A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	struct FRawDistributionFloat                       BrightnessCurve;                                  		// 0x02CC (0x0024) [0x00000000044A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	struct FLinearColor                                SunTint;                                          		// 0x02F0 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	class UBioSpriteTranslucentComponent*              SunSprite;                                        		// 0x0300 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       HaloSprite;                                       		// 0x0308 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite0;                                     		// 0x0310 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite1;                                     		// 0x0318 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite2;                                     		// 0x0320 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite3;                                     		// 0x0328 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite4;                                     		// 0x0330 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite5;                                     		// 0x0338 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite6;                                     		// 0x0340 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite7;                                     		// 0x0348 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite8;                                     		// 0x0350 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareComponent*                       FlareSprite9;                                     		// 0x0358 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite0;                                    		// 0x0360 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite1;                                    		// 0x0368 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite2;                                    		// 0x0370 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite3;                                    		// 0x0378 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite4;                                    		// 0x0380 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBioSunFlareStreakComponent*                 StreakSprite5;                                    		// 0x0388 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              FocusDistance;                                    		// 0x0390 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              AutoScaleDistance;                                		// 0x0394 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fIntensityCurveAccumulator;                       		// 0x0398 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fScaleCurveAccumulator;                           		// 0x039C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fBrightnessCurveAccumulator;                      		// 0x03A0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fDyingFadePercent;                                		// 0x03A4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fFadeTime;                                        		// 0x03A8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      UseBaseLightTint : 1;                             		// 0x03AC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      HideAllFlaresOverride : 1;                        		// 0x03AC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      ViewDependentIntensity : 1;                       		// 0x03AC (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bAnimateIntensity : 1;                            		// 0x03AC (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bAnimateScale : 1;                                		// 0x03AC (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bAnimateBrightness : 1;                           		// 0x03AC (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bDying : 1;                                       		// 0x03AC (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioTacticalMoveToIndicator
// 0x0010 (0x0294 - 0x0284)
class ABioTacticalMoveToIndicator : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleSystem;                                   		// 0x0284 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_fFadeInTime;                                    		// 0x028C (0x0004) [0x0000000000000000]              
	float                                              m_fTimePassed;                                    		// 0x0290 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioTriggerStream
// 0x0020 (0x02E4 - 0x02C4)
class ABioTriggerStream : public ATriggerVolume
{
public:
	struct TArray<struct FBioStreamingState>           StreamingStates;                                  		// 0x02C4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UGFxMovieInfo*                               m_oAreaMapOverride;                               		// 0x02D4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_StoredStateIndex;                               		// 0x02DC (0x0004) [0x0000000000000000]              
	int                                                m_nPriorityLevel;                                 		// 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
	void ForegroundStreamingDone ( struct TArray<class USequence*> Sequences, class APawn* PlayerPawn );
	void BackgroundStreamingDone ( struct TArray<class USequence*> Sequences, class APawn* PlayerPawn );
	void Retouch ( );
	void DoStasis ( class AActor* Touched, unsigned long bTouched );
	void DoUntouch ( class AActor* Other );
	void DoTouch ( );
};

// Class SFXGame.Bio_Appr_Character_Base_Settings
// 0x0004 (0x0074 - 0x0070)
class UBio_Appr_Character_Base_Settings : public UComponent
{
public:
	unsigned long                                      m_bIsShowingMissingResources : 1;                 		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Body_Settings
// 0x0016 (0x008A - 0x0074)
class UBio_Appr_Character_Body_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_HeadGear_Settings*       m_oHeadGearSettings;                              		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nModelVariant;                                  		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialConfig;                                		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHeadGearLoaded : 1;                          		// 0x0084 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadGearHidden : 1;                          		// 0x0084 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned char                                      m_eArmorType;                                     		// 0x0088 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eVisualOverride;                                		// 0x0089 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Hair_Settings
// 0x0004 (0x0078 - 0x0074)
class UBio_Appr_Character_Hair_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	int                                                m_nMaterial;                                      		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_HeadGear_Settings
// 0x0025 (0x0099 - 0x0074)
class UBio_Appr_Character_HeadGear_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	struct FBioHeadGearComponentSettings               m_visor;                                          		// 0x0074 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FBioHeadGearComponentSettings               m_facePlate;                                      		// 0x0080 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nModelSpec;                                     		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialConfig;                                		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                     		// 0x0094 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      m_eVisualOverride;                                		// 0x0098 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Head_Settings
// 0x0010 (0x0084 - 0x0074)
class UBio_Appr_Character_Head_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_Hair_Settings*           m_oHairSettings;                                  		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nMaterialConfig;                                		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nHairAppearance;                                		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Settings
// 0x0018 (0x008C - 0x0074)
class UBio_Appr_Character_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_Body_Settings*           m_oBodySettings;                                  		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	class UBio_Appr_Character_Head_Settings*           m_oHeadSettings;                                  		// 0x007C (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nHeadAppearance;                                		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHeadHidden : 1;                              		// 0x0088 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadLoaded : 1;                              		// 0x0088 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXDifficultyHandler
// 0x006D (0x00CD - 0x0060)
class USFXDifficultyHandler : public UObject
{
public:
	struct TArray<struct FDifficultySettings>          Level1DifficultyData;                             		// 0x0060 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FDifficultySettings>          Level2DifficultyData;                             		// 0x0070 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FDifficultySettings>          Level3DifficultyData;                             		// 0x0080 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
