/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGameContent_Powers_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGameContent_Powers.BioPowerScriptDesign.AdjustInventoryResource
// [0x00020002] 
struct UBioPowerScriptDesign_execAdjustInventoryResource_Parms
{
	class AActor*                                      oActor;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eResource;                                        		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAmount;                                          		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioEpicPawnBehavior*                     oBehavior;                                        		// 0x0014 (0x0008) [0x0000000000000000]              
	// class ABioPlayerSquad*                          oPlayerSquad;                                     		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioInventory*                            oInventory;                                       		// 0x0024 (0x0008) [0x0000000000000000]              
	// float                                           fCurrentAmount;                                   		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectCarnageSetup
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectCarnageSetup_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nNumberOfUses;                                    		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalOnWeaponChange* oWeaponChangeConditional;                         		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalWeaponPowerUsed* oPowerUseConditional;                             		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.InstantRegenerateShield
// [0x00020002] 
struct UBioPowerScriptDesign_execInstantRegenerateShield_Parms
{
	class AActor*                                      oActor;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fPercentOfShieldRegained;                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioActorBehavior*                        oBehavior;                                        		// 0x0010 (0x0008) [0x0000000000000000]              
	// float                                           fAmount;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.IncreaseAllPowerCooldowns
// [0x00024002] 
struct UBioPowerScriptDesign_execIncreaseAllPowerCooldowns_Parms
{
	class AActor*                                      oActor;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fPercentOfTotalToIncreaseBy;                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bIncreaseTech;                                    		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bIncreaseBiotic;                                  		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bIncreaseWeapon;                                  		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bIncreaseCombat;                                  		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioEpicPawnBehavior*                     oBehavior;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0028 (0x0004) [0x0000000000000000]              
	// class UBioPower*                                oPower;                                           		// 0x002C (0x0008) [0x0000000000000000]              
	// float                                           fCooldownRemaining;                               		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           fTotalCooldown;                                   		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.ClearAllPowerCooldowns
// [0x00020002] 
struct UBioPowerScriptDesign_execClearAllPowerCooldowns_Parms
{
	class AActor*                                      oActor;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioEpicPawnBehavior*                     oBehavior;                                        		// 0x000C (0x0008) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// class UBioPower*                                oPower;                                           		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectSingularity
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectSingularity_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     vSingularityLocation;                             		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fForce;                                           		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fForceInterval;                                   		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fBubbleRadius;                                    		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x002C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0030 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oCasterBehavior;                                  		// 0x0038 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oTargetBehavior;                                  		// 0x0040 (0x0008) [0x0000000000000000]              
	// class UBioPawnBehavior*                         oTargetPawnBehavior;                              		// 0x0048 (0x0008) [0x0000000000000000]              
	// class UBioBaseAppearance*                       oAppearance;                                      		// 0x0050 (0x0008) [0x0000000000000000]              
	// struct FName                                    nmBoneName;                                       		// 0x0058 (0x0008) [0x0000000000000000]              
	// struct FVector                                  vPosition;                                        		// 0x0060 (0x000C) [0x0000000000000000]              
	// float                                           fOuterBubbleRange;                                		// 0x006C (0x0004) [0x0000000000000000]              
	// float                                           fVelocityThresholdOuterBubble;                    		// 0x0070 (0x0004) [0x0000000000000000]              
	// float                                           fInnerBubbleRange;                                		// 0x0074 (0x0004) [0x0000000000000000]              
	// float                                           fBubbleForce;                                     		// 0x0078 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectRagdoll
// [0x00024002] 
struct UBioPowerScriptDesign_execEffectRagdoll_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nGroupID;                                         		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oCasterBehavior;                                  		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioPawnBehavior*                         oTargetBehavior;                                  		// 0x002C (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oTarget;                                          		// 0x0034 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectEntrenchShield
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectEntrenchShield_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fShieldInc;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioEpicPawnBehavior*                     oImpactedInfo;                                    		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectRegenerateShield
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectRegenerateShield_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAmountPerInterval;                               		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fInterval;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectDamageVulnerability
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectDamageVulnerability_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamageMultiplier;                                		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectRegen
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectRegen_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHealingFactor;                                   		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectHealInstant
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectHealInstant_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHealth;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fToxic;                                           		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectHeal
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectHeal_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHealthPerInterval;                               		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fToxicPerInterval;                                		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fInterval;                                        		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectCombatBoost
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectCombatBoost_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDmgDurBonus;                                     		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRegenBonus;                                      		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fSuppResistBonus;                                 		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMobilityBonus;                                   		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0028 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectImmunity
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectImmunity_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamageResistBonus;                               		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectSniperCritical
// [0x00024002] 
struct UBioPowerScriptDesign_execEffectSniperCritical_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamageBonus;                                     		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fStunDuration;                                    		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fMaxDriftRed;                                     		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fMinDriftRed;                                     		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         pStunSubProperty;                                 		// 0x0028 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0030 (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalOnWeaponChange* oConditional;                                     		// 0x0038 (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalHasNotFired*   pHasNotFired;                                     		// 0x0040 (0x0008) [0x0000000000000000]              
	// class UBioGameEffectGiveGP*                     pGiveGPEffect;                                    		// 0x0048 (0x0008) [0x0000000000000000]              
	// class UBioGameEffectAttributeBool*              pClearHasFired;                                   		// 0x0050 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectOverkill
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectOverkill_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fSuppDamage;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fKickbackRed;                                     		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHeatRed;                                         		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamageBonus;                                     		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalOnWeaponChange* oConditional;                                     		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectMarksman
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectMarksman_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMaxDriftRed;                                     		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMinDriftRed;                                     		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamageBonus;                                     		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRPSBonus;                                        		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHeatRed;                                         		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x002C (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalOnWeaponChange* oConditional;                                     		// 0x0034 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectCorrosion
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectCorrosion_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCorrosion;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectSuppressingFire
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectSuppressingFire_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDriftInc;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectZeroGLift
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectZeroGLift_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fLiftForce;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fLiftDistance;                                    		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDeceleration;                                    		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMinVelocity;                                     		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioActorBehavior*                        oCasterBehavior;                                  		// 0x0028 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oTargetBehavior;                                  		// 0x0030 (0x0008) [0x0000000000000000]              
	// class UBioPawnBehavior*                         oTargetPawnBehavior;                              		// 0x0038 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x0040 (0x0008) [0x0000000000000000]              
	// struct FVector                                  vForce;                                           		// 0x0048 (0x000C) [0x0000000000000000]              
	// struct FVector                                  vDestination;                                     		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FVector                                  vPosition;                                        		// 0x0060 (0x000C) [0x0000000000000000]              
	// struct FName                                    nmBoneName;                                       		// 0x006C (0x0008) [0x0000000000000000]              
	// class UBioBaseAppearance*                       oAppearance;                                      		// 0x0074 (0x0008) [0x0000000000000000]              
	// struct FVector                                  vDeceleration;                                    		// 0x007C (0x000C) [0x0000000000000000]              
	// class ABioPawn*                                 oBioPawn;                                         		// 0x0088 (0x0008) [0x0000000000000000]              
	// unsigned long                                   bApplyToAllBones;                                 		// 0x0090 (0x0004) [0x0000000000000000]              
	// class ABioArtPlaceable*                         oArtPlaceable;                                    		// 0x0094 (0x0008) [0x0000000000000000]              
	// class UBioArtPlaceableType*                     oArtPlaceableType;                                		// 0x009C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectAIHacking
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectAIHacking_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioEpicPawnBehavior*                     oCasterBehavior;                                  		// 0x0018 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oTargetBehavior;                                  		// 0x0020 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x0028 (0x0008) [0x0000000000000000]              
	// int                                             srImpactText;                                     		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectDisablePowers
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectDisablePowers_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nGFXGroup;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisableTech;                                     		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisableBiotics;                                  		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisableWeaponPowers;                             		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisableCombat;                                   		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x002C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0034 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectOverheatWeapons
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectOverheatWeapons_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHeat;                                            		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oCasterBehavior;                                  		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioPawnBehavior*                         oImpactedBehavior;                                		// 0x002C (0x0008) [0x0000000000000000]              
	// class UBioGamePropertyConditionalOnWeaponChange* oConditional;                                     		// 0x0034 (0x0008) [0x0000000000000000]              
	// class ABioWeapon*                               oWeapon;                                          		// 0x003C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectDisableWeapons
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectDisableWeapons_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nGFXGroup;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectDisableActions
// [0x00024002] 
struct UBioPowerScriptDesign_execEffectDisableActions_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nGFXGroup;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisableActionQueue;                              		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bDisableMovementStack;                            		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectAdjustStability
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectAdjustStability_Parms
{
	class ABioPawn*                                    oTarget;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAmount;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fApplyInterval;                                   		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fTotalTime;                                       		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGameProperty*                         oProperty;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectDamageOverTime
// [0x00024002] 
struct UBioPowerScriptDesign_execEffectDamageOverTime_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamagePerInterval;                               		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     vMomentumPerInterval;                             		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UBioDamageType*                              pDamage;                                          		// 0x0020 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fInterval;                                        		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nGroup;                                           		// 0x0030 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0034 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APawn*                                    oPawn;                                            		// 0x0038 (0x0008) [0x0000000000000000]              
	// class AController*                              oController;                                      		// 0x0040 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x0048 (0x0008) [0x0000000000000000]              
	// class UBioActorBehavior*                        oActorBehavior;                                   		// 0x0050 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.EffectTakeDamage
// [0x00020002] 
struct UBioPowerScriptDesign_execEffectTakeDamage_Parms
{
	class AActor*                                      oImpacted;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamage;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     vMomentum;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UBioDamageType*                              pDamage;                                          		// 0x0020 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APawn*                                    oPawn;                                            		// 0x002C (0x0008) [0x0000000000000000]              
	// class AController*                              oController;                                      		// 0x0034 (0x0008) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x003C (0x0008) [0x0000000000000000]              
	// float                                           fDistanceScale;                                   		// 0x0044 (0x0004) [0x0000000000000000]              
	// unsigned char                                   eDamageFalloff;                                   		// 0x0048 (0x0001) [0x0000000000000000]              
	// class UBioAttributesDamage*                     oDamageAttributes;                                		// 0x004C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.SpawnBeacon
// [0x00024002] 
struct UBioPowerScriptDesign_execSpawnBeacon_Parms
{
	class UBioActorBehavior*                           oCasterBehavior;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sBeaconActorType;                                 		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FVector                                     vLocation;                                        		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    vFacing;                                          		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFloatingBeacon;                                  		// 0x0034 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bSnapToFloor;                                     		// 0x0038 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bSpawnAsProxMine;                                 		// 0x003C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fSquadActivateDelay;                              		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fRadiusMulti;                                     		// 0x0044 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fDamageMulti;                                     		// 0x0048 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      oOwner;                                           		// 0x004C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      ReturnValue;                                      		// 0x0054 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   oBeacon;                                          		// 0x005C (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oBeaconPawn;                                      		// 0x0064 (0x0008) [0x0000000000000000]              
	// class UBioPawnBehavior*                         oBeaconInfo;                                      		// 0x006C (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            oCasterSquad;                                     		// 0x0074 (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            oNewSquad;                                        		// 0x007C (0x0008) [0x0000000000000000]              
	// class ABioBaseSquadDesign*                      oNewSquadDesign;                                  		// 0x0084 (0x0008) [0x0000000000000000]              
	// class UBioAttributesPawn*                       oBeaconAttrib;                                    		// 0x008C (0x0008) [0x0000000000000000]              
	// class UBioAttributesPawn*                       oCasterAttrib;                                    		// 0x0094 (0x0008) [0x0000000000000000]              
	// int                                             nPowerIndex;                                      		// 0x009C (0x0004) [0x0000000000000000]              
	// class UBioGameProperty*                         oProperty;                                        		// 0x00A0 (0x0008) [0x0000000000000000]              
	// class UBioGameEffectPowerAttributeFloat*        oRadInc;                                          		// 0x00A8 (0x0008) [0x0000000000000000]              
	// class UBioGameEffectPowerAttributeFloat*        oRangeInc;                                        		// 0x00B0 (0x0008) [0x0000000000000000]              
	// class UBioGameEffectPowerParameter*             oDamageInc;                                       		// 0x00B8 (0x0008) [0x0000000000000000]              
	// class UBioPower*                                oPower;                                           		// 0x00C0 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.SpawnBarrier
// [0x00024002] 
struct UBioPowerScriptDesign_execSpawnBarrier_Parms
{
	class UBioActorBehavior*                           oCasterBehavior;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sBarrierActorType;                                		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FVector                                     vLocation;                                        		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    vFacing;                                          		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fHealth;                                          		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSnapToFloor;                                     		// 0x0038 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bAddToSquadCover;                                 		// 0x003C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      oOwner;                                           		// 0x0040 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      ReturnValue;                                      		// 0x0048 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   oBarrier;                                         		// 0x0050 (0x0008) [0x0000000000000000]              
	// class ABioArtPlaceable*                         oBarrierAPL;                                      		// 0x0058 (0x0008) [0x0000000000000000]              
	// class UBioArtPlaceableBehavior*                 oBarrierInfo;                                     		// 0x0060 (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            oCasterSquad;                                     		// 0x0068 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioPowerScriptDesign.WeaponPowerActivated
// [0x00020002] 
struct UBioPowerScriptDesign_execWeaponPowerActivated_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bNeedsRetrigger;                                  		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
