/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFXGame.Bio2DA.Bio2DACellData
// 0x000C
struct FBio2DACellData
{
	unsigned char                                      nDataType_NATIVE_MIRROR;                          		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FPointer                                    nData_NATIVE_MIRROR;                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.Bio2DA.Bio2daMasterRowIndexRec
// 0x000C
struct FBio2daMasterRowIndexRec
{
	class UBio2DA*                                     pTable;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                nRowIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioBaseAppearance.MorphFeatureModelType
// 0x0018
struct FMorphFeatureModelType
{
	struct FName                                       sFeatureName;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	class USkeletalMeshComponent*                      MinModel;                                         		// 0x0008 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      MaxModel;                                         		// 0x0010 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
};

// ScriptStruct SFXGame.BioBaseAppearance.MorphFeatureType
// 0x0008
struct FMorphFeatureType
{
	struct FName                                       sFeatureName;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.BioVersionedNativeObject
// 0x0004
struct FBioVersionedNativeObject
{
	int                                                nInstanceVersion;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioStateEventElement
// 0x0008(0x000C - 0x0004)
struct FBioStateEventElement : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
};

// ScriptStruct SFXGame.BioDefine.BioStateEvent
// 0x0018(0x001C - 0x0004)
struct FBioStateEvent : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FPointer>                     lstEventElements;                                 		// 0x000C (0x0010) [0x0000000000101000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioDefine.BioSEEBool
// 0x0010(0x001C - 0x000C)
struct FBioSEEBool : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalBool;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNewState : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseParam : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioDefine.BioSEEConsequence
// 0x000C(0x0018 - 0x000C)
struct FBioSEEConsequence : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nConsequence;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEFloat
// 0x0014(0x0020 - 0x000C)
struct FBioSEEFloat : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bUseParam : 1;                                    		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIncrement : 1;                                   		// 0x0014 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                nGlobalFloat;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              fNewValue;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEFunction
// 0x0024(0x0030 - 0x000C)
struct FBioSEEFunction : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct FName                                       FunctionPackage;                                  		// 0x0014 (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionClass;                                    		// 0x001C (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionName;                                     		// 0x0024 (0x0008) [0x0000000000100000]              
	int                                                nParameter;                                       		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEInt
// 0x0014(0x0020 - 0x000C)
struct FBioSEEInt : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalInt;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nNewValue;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseParam : 1;                                    		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIncrement : 1;                                   		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioDefine.BioSEELocal
// 0x0020(0x002C - 0x000C)
struct FBioSEELocal : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bUseParam : 1;                                    		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                nObjectType;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FName                                       ObjectTag;                                        		// 0x001C (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionName;                                     		// 0x0024 (0x0008) [0x0000000000100000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalBool
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalBool : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bNewValue : 1;                                    		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalFloat
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalFloat : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	float                                              fNewValue;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalInt
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalInt : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nNewValue;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEESubstate
// 0x0024(0x0030 - 0x000C)
struct FBioSEESubstate : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalBool;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNewState : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseParam : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bParentTypeOr : 1;                                		// 0x0018 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                nParentIndex;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	struct TArray<int>                                 lstSiblingIndices;                                		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioQuestProgress
// 0x0020(0x0024 - 0x0004)
struct FBioQuestProgress : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nQuestAdded;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuestUpdated : 1;                                		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	struct TArray<int>                                 lstTaskHistory;                                   		// 0x0014 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioQuestGoal
// 0x0018(0x001C - 0x0004)
struct FBioQuestGoal : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                srName;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioQuestTask
// 0x003C(0x0040 - 0x0004)
struct FBioQuestTask : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bQuestCompleteTask : 1;                           		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                srName;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	struct TArray<int>                                 lstPlotItemIndices;                               		// 0x0018 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sWaypointTag;                                     		// 0x0028 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FName                                       nmPlanet;                                         		// 0x0038 (0x0008) [0x0000000000100000]              
};

// ScriptStruct SFXGame.BioDefine.BioPlotItem
// 0x001C(0x0020 - 0x0004)
struct FBioPlotItem : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                srName;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nIconIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nTargetItems;                                     		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioQuest
// 0x003C(0x0040 - 0x0004)
struct FBioQuest : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioQuestGoal>                lstGoals;                                         		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBioQuestTask>                lstTasks;                                         		// 0x001C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBioPlotItem>                 lstPlotItems;                                     		// 0x002C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      bMission : 1;                                     		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioTaskEval
// 0x0018(0x001C - 0x0004)
struct FBioTaskEval : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nQuest;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nTask;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioStateTaskList
// 0x0018(0x001C - 0x0004)
struct FBioStateTaskList : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioTaskEval>                 lstTaskEvals;                                     		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioCodexEntry
// 0x0018(0x001C - 0x0004)
struct FBioCodexEntry : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                srTitle;                                          		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nTextureIndex;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nPriority;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioCodexPage
// 0x000C(0x0028 - 0x001C)
struct FBioCodexPage : FBioCodexEntry
{
	struct FPointer                                    VfTable;                                          		// 0x001C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nSection;                                         		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioCodexSection
// 0x000C(0x0028 - 0x001C)
struct FBioCodexSection : FBioCodexEntry
{
	struct FPointer                                    VfTable;                                          		// 0x001C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bPrimary : 1;                                     		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioDiscoveredCodexPage
// 0x0010(0x0014 - 0x0004)
struct FBioDiscoveredCodexPage : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nPage;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bNew : 1;                                         		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioDiscoveredCodex
// 0x0018(0x001C - 0x0004)
struct FBioDiscoveredCodex : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioDiscoveredCodexPage>      lstDiscoveredPages;                               		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.VisualEffect
// 0x0010
struct FVisualEffect
{
	class UBioVFXTemplate*                             Template;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class ABioVisualEffect*                            Effect;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.HenchmanInfoStruct
// 0x0038
struct FHenchmanInfoStruct
{
	struct FName                                       ClassName;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       Tag;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	int                                                PrettyName;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                AlternatePrettyName;                              		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FName                                       AlternateHenchNamePlotFlag;                       		// 0x0018 (0x0008) [0x0000000000000000]              
	int                                                HenchAcquiredPlotID;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                HenchInSquadPlotID;                               		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FString                                     HenchmanImage;                                    		// 0x0028 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.PlayerMeshInfo
// 0x0084
struct FPlayerMeshInfo
{
	struct FString                                     Male;                                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleVisor;                                        		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleFaceplate;                                    		// 0x0020 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleMaterialOverride;                             		// 0x0030 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Female;                                           		// 0x0040 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleVisor;                                      		// 0x0050 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleFaceplate;                                  		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleMaterialOverride;                           		// 0x0070 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bHasBreather : 1;                                 		// 0x0080 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bHideHead : 1;                                    		// 0x0080 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bHideHair : 1;                                    		// 0x0080 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerPatternInfo
// 0x0078
struct FPlayerPatternInfo
{
	struct FVectorParameterValue                       Stripe1Param;                                     		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe2Param;                                     		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe3Param;                                     		// 0x0050 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerTintInfo
// 0x0050
struct FPlayerTintInfo
{
	struct FVectorParameterValue                       TintParam;                                        		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       PhongParam;                                       		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerSpecInfo
// 0x0038
struct FPlayerSpecInfo
{
	struct FScalarParameterValue                       SpecParam;                                        		// 0x0000 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FScalarParameterValue                       SpecPwrParam;                                     		// 0x001C (0x001C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.CustomizableElement
// 0x01A9
struct FCustomizableElement
{
	struct FPlayerMeshInfo                             Mesh;                                             		// 0x0000 (0x0084) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FString>                      GameEffects;                                      		// 0x0084 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FPlayerPatternInfo                          Pattern;                                          		// 0x0094 (0x0078) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerTintInfo                             Tint;                                             		// 0x010C (0x0050) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerSpecInfo                             Spec;                                             		// 0x015C (0x0038) [0x0000000000000001]              ( CPF_Edit )
	int                                                Id;                                               		// 0x0194 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Name;                                             		// 0x0198 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Description;                                      		// 0x019C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlotFlag;                                         		// 0x01A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bCustomizable : 1;                                		// 0x01A4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x01A8 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor3Value
// 0x001C
struct FPlayerCustomColor3Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor2Value
// 0x001C
struct FPlayerCustomColor2Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor1Value
// 0x0034
struct FPlayerCustomColor1Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                PhongParameterValue;                              		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       PhongParameterName;                               		// 0x0028 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternColorValue
// 0x004C
struct FPlayerCustomPatternColorValue
{
	struct FLinearColor                                Stripe1ColorValue;                                		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ColorValue;                                		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ColorValue;                                		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ColorName;                                 		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ColorName;                                 		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ColorName;                                 		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternValue
// 0x004C
struct FPlayerCustomPatternValue
{
	struct FLinearColor                                Stripe1ParameterValue;                            		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ParameterValue;                            		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ParameterValue;                            		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ParameterName;                             		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ParameterName;                             		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ParameterName;                             		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                PatternName;                                      		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear_Settings.BioHeadGearComponentSettings
// 0x000C
struct FBioHeadGearComponentSettings
{
	int                                                m_nMeshIndex;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialIndex;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                     		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHidden : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bIsLoaded : 1;                                  		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character.LookAtBoneDef
// 0x0022
struct FLookAtBoneDef
{
	struct FName                                       m_nBoneName;                                      		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fLimit;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fUpDownLimit;                                   		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fDelay;                                         		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fSpeedFactor;                                   		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fConversationStrength;                          		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bSeparateUpDownLimit : 1;                       		// 0x001C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bUseUpAxis : 1;                                 		// 0x001C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bLookAtInverted : 1;                            		// 0x001C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bUpAxisInverted : 1;                            		// 0x001C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned char                                      m_nLookAxis;                                      		// 0x0020 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_nUpAxis;                                        		// 0x0021 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ModelVariation
// 0x000C
struct FModelVariation
{
	int                                                NumVariations;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaterialsPerVariation;                            		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bHasHeadGear : 1;                               		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.ArmorTypes
// 0x0029
struct FArmorTypes
{
	struct TArray<struct FModelVariation>              Variations;                                       		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       m_meshPackageName;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_materialPackageName;                            		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicsAsset*                               ArmorPhysicsAsset;                                		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ArmorType;                                        		// 0x0028 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.WeaponAnimSpec
// 0x0028
struct FWeaponAnimSpec
{
	struct FString                                     AnimType;                                         		// 0x0000 (0x0010) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	struct TArray<class UAnimSet*>                     m_animSets;                                       		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimSet*                                    m_drawAnimSet;                                    		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Body.OverrideAnimTreeTemplate
// 0x0009
struct FOverrideAnimTreeTemplate
{
	class UAnimTree*                                   AnimTreeTemplate;                                 		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      eClassification;                                  		// 0x0008 (0x0001) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioCharacterHeadAppearanceMaterialConfig
// 0x0010
struct FBioCharacterHeadAppearanceMaterialConfig
{
	struct TArray<class UMaterialInterface*>           m_aMaterials;                                     		// 0x0000 (0x0010) [0x0000000000400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.Bio_Appr_Character_Head.BioWrinkleConfig
// 0x0018
struct FBioWrinkleConfig
{
	struct FString                                     WrinkleParameterName;                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  WrinkleTexture;                                   		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioFacePlateMeshSpec
// 0x000C
struct FBioFacePlateMeshSpec
{
	class USkeletalMesh*                               m_pMesh;                                          		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bHidesVisor : 1;                                		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceModelSpec
// 0x000C
struct FBioHeadGearAppearanceModelSpec
{
	int                                                m_nMaterialConfigCount;                           		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialCountPerConfig;                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHairHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadHidden : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bSuppressFacePlate : 1;                         		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_bSuppressVisor : 1;                             		// 0x0008 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
};

// ScriptStruct SFXGame.Bio_Appr_Character_HeadGear.BioHeadGearAppearanceArmorSpec
// 0x0019
struct FBioHeadGearAppearanceArmorSpec
{
	struct TArray<struct FBioHeadGearAppearanceModelSpec> m_aModelSpec;                                     		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       m_nmPackage;                                      		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eArmorType;                                     		// 0x0018 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioVisualEffect.InterpPropertyInfo
// 0x000C
struct FInterpPropertyInfo
{
	class UObject*                                     Outer;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Offset;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioVisualEffect.CachedInstanceParameter
// 0x0020
struct FCachedInstanceParameter
{
	struct TArray<struct FInterpPropertyInfo>          OffsetInfo;                                       		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000000]              
	float                                              fCurrentValue;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bInited : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VFXAPLStatePair
// 0x0009
struct FVFXAPLStatePair
{
	struct FName                                       m_nmAPLState;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_VFXState;                                       		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.VisualEffectAttachment
// 0x0020
struct FVisualEffectAttachment
{
	struct TArray<struct FVFXAPLStatePair>             m_States;                                         		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UBioVFXTemplate*                             m_oEffectTemplate;                                		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmSocket;                                       		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioBaseAppearancePlaceable.StaticAttachments
// 0x0010
struct FStaticAttachments
{
	struct FName                                       BoneName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioActorBehavior.BioVOSettings
// 0x0009
struct FBioVOSettings
{
	struct FColor                                      cSubtitleColour;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      bSuppressSubtitlesIfVO : 1;                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bAlert : 1;                                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned char                                      nSubtitleMode;                                    		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioActorBehavior.BioDamageReporter
// 0x001C
struct FBioDamageReporter
{
	float                                              fShieldDamage;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fShieldDamageCapacity;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fHealthDamage;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              fToxicDamage;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              fStabilityDamage;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fDamageResistance;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fToxicResistance;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAiController.EnemyInfo
// 0x0040
struct FEnemyInfo
{
	struct FVector                                     KnownLocation;                                    		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     InterpLocation;                                   		// 0x000C (0x000C) [0x0000000000000000]              
	struct FCoverInfo                                  Cover;                                            		// 0x0018 (0x000C) [0x0000000000000000]              
	class APawn*                                       Pawn;                                             		// 0x0024 (0x0008) [0x0000000000000000]              
	float                                              InterpTime;                                       		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              InitialSeenTime;                                  		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              LastSeenTime;                                     		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              LastFailedPathTime;                               		// 0x0038 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVisible : 1;                                     		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAiController.DelayUpdateInfo
// 0x0015
struct FDelayUpdateInfo
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       EventName;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	float                                              UpdateTime;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0014 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutNode
// 0x000C
struct FBioAnimCheckBlendOutNode
{
	class UAnimNodeBlendList*                          Node;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Index;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutPath
// 0x0018
struct FBioAnimCheckBlendOutPath
{
	struct TArray<struct FBioAnimCheckBlendOutNode>    Nodes;                                            		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FPointer                                    Next;                                             		// 0x0010 (0x0008) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioAnimMovementSync.BioAnimMovementSyncNode
// 0x0010
struct FBioAnimMovementSyncNode
{
	class UAnimNode*                                   Node;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	class UAnimNode*                                   NodeWeight;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlend_TurnInPlace.RotTransitionInfo
// 0x0008
struct FRotTransitionInfo
{
	float                                              RotationOffset;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ChildIndex;                                       		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAction.BlendTime
// 0x0005
struct FBlendTime
{
	float                                              m_fTime;                                          		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eAnimNode;                                      		// 0x0004 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAim.BioAnimNodeBlendByAimLimits
// 0x0010
struct FBioAnimNodeBlendByAimLimits
{
	float                                              DegreesLeft;                                      		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesRight;                                     		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesUp;                                        		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesDown;                                      		// 0x000C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct SFXGame.BioAnimNodeBlendMultiAdditive.BioChildActivateData
// 0x0010
struct FBioChildActivateData
{
	float                                              fFinalWeight;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fRemainingTime;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fTotalBlendTime;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bApplyData : 1;                                   		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioChildPinData
// 0x0020
struct FBioChildPinData
{
	struct TArray<class UBioGestChainTree*>            aChainedTrees;                                    		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              fEndBlendStartTime;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fEndTime;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bPlayUntilNext : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseDynAnimSets : 1;                              		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioEndBlendData
// 0x0008
struct FBioEndBlendData
{
	float                                              fEndBlendStartTime;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarBlendParams
// 0x000C
struct FBioScalarBlendParams
{
	float                                              Min;                                              		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Peak;                                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Max;                                              		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarPrecomputedValues
// 0x0008
struct FBioScalarPrecomputedValues
{
	float                                              fRangeLowerRatio;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fRangeUpperRatio;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeChildDef
// 0x0014
struct FBioAnimScalarNodeChildDef
{
	struct FBioScalarBlendParams                       BlendParams;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FName                                       Name;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeBehaviorDef
// 0x002C
struct FBioAnimScalarNodeBehaviorDef
{
	struct TArray<struct FBioAnimScalarNodeChildDef>   Children;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              BlendPctPerSecond;                                		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              DefaultScalar;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	unsigned long                                      BlendInstant : 1;                                 		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendState.BioAnimBlendParams
// 0x0011
struct FBioAnimBlendParams
{
	struct TArray<float>                               BlendToChildTimes;                                		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      PlayMode;                                         		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeChildDef
// 0x0020
struct FBioAnimStateNodeChildDef
{
	struct FBioAnimBlendParams                         BlendParams;                                      		// 0x0000 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       Name;                                             		// 0x0014 (0x0008) [0x0000000000000000]              
	float                                              DefaultWeight;                                    		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeBehaviorDef
// 0x0010
struct FBioAnimStateNodeBehaviorDef
{
	struct TArray<struct FBioAnimStateNodeChildDef>    Children;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAnimNodeSequenceByBoneRotation.AnimByRotation
// 0x001C
struct FAnimByRotation
{
	struct FRotator                                    DesiredRotation;                                  		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AnimName;                                         		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAnimSequence*                               AnimSeq;                                          		// 0x0014 (0x0008) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
};

// ScriptStruct SFXGame.BioAppearanceItemWeapon.BioAppearanceItemWeaponVFXSpec
