/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGame.BioDestinationArrow.SetArrowColor
// [0x00020802] ( FUNC_Event )
struct ABioDestinationArrow_eventSetArrowColor_Parms
{
	unsigned char                                      clr;                                              		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// class UMaterialInstanceConstant*                MC;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioHintSystemBase.TruncateNotificationBody
// [0x00020802] ( FUNC_Event )
struct UBioHintSystemBase_eventTruncateNotificationBody_Parms
{
	struct FString                                     sBody;                                            		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioHintSystemBase.CacheCurrentState
// [0x00020800] ( FUNC_Event )
struct UBioHintSystemBase_eventCacheCurrentState_Parms
{
};

// Function SFXGame.BioHintSystemBase.Tick
// [0x00020400] ( FUNC_Native )
struct UBioHintSystemBase_execTick_Parms
{
	float                                              TimeDelta;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.TimeSince
// [0x00020400] ( FUNC_Native )
struct UBioHintSystemBase_execTimeSince_Parms
{
	float                                              fTime;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioHintSystemBase.GetPreviousTime
// [0x00420400] ( FUNC_Native )
struct UBioHintSystemBase_execGetPreviousTime_Parms
{
	struct FHintTrackingData                           oData;                                            		// 0x0000 (0x0038) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                nAge;                                             		// 0x0038 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x003C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioHintSystemBase.GetTrackingData
// [0x00024400] ( FUNC_Native )
struct UBioHintSystemBase_execGetTrackingData_Parms
{
	struct FName                                       nmEvent;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmContext;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FHintTrackingData                           ReturnValue;                                      		// 0x0010 (0x0038) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioHintSystemBase.Clear
// [0x00020400] ( FUNC_Native )
struct UBioHintSystemBase_execClear_Parms
{
};

// Function SFXGame.BioHintSystemBase.HintEvent
// [0x00024400] ( FUNC_Native )
struct UBioHintSystemBase_execHintEvent_Parms
{
	struct FName                                       nmEvent;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmContext;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.ClearNotifications
// [0x00020002] 
struct UBioHintSystemBase_execClearNotifications_Parms
{
};

// Function SFXGame.BioHintSystemBase.OnNotificationCompleted
// [0x00820002] 
struct UBioHintSystemBase_execOnNotificationCompleted_Parms
{
	// struct FSFXNotification                         CurrentNotification;                              		// 0x0000 (0x006C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class ABioWorldInfo*                            oWorldInfo;                                       		// 0x006C (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     oController;                                      		// 0x0074 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioHintSystemBase.IsHintsOptionDisabled
// [0x00020802] ( FUNC_Event )
struct UBioHintSystemBase_eventIsHintsOptionDisabled_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPlayerController*                     oPC;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioHintSystemBase.SetNotificationPaused
// [0x00020002] 
struct UBioHintSystemBase_execSetNotificationPaused_Parms
{
	unsigned long                                      bVal;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.JournalUpdate
// [0x00020802] ( FUNC_Event )
struct UBioHintSystemBase_eventJournalUpdate_Parms
{
	int                                                srTitle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                srDescription;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.CodexUpdate
// [0x00020802] ( FUNC_Event )
struct UBioHintSystemBase_eventCodexUpdate_Parms
{
	int                                                srTitle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                srDescription;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.PopulateNotificationOneParameter
// [0x00480401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execPopulateNotificationOneParameter_Parms
{
	struct FSFXNotificationData                        oNoteData;                                        		// 0x0000 (0x0050) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FSFXNotification                            oNotification;                                    		// 0x0050 (0x006C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nParam1;                                          		// 0x00BC (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.GetNotificationData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execGetNotificationData_Parms
{
	struct FName                                       nmNotificationType;                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FSFXNotificationData                        ReturnValue;                                      		// 0x0008 (0x0050) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioHintSystemBase.ShowNotification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execShowNotification_Parms
{
	struct FSFXNotification                            oNotification;                                    		// 0x0000 (0x006C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioHintSystemBase.AddNotification_Custom
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_Custom_Parms
{
	float                                              nDisplayTime;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sTitle;                                           		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sSubtitle;                                        		// 0x0014 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sBody;                                            		// 0x0024 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UTexture*                                    Image;                                            		// 0x0034 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nRemoteEvent;                                     		// 0x003C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmType;                                           		// 0x0044 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       nmSound;                                          		// 0x004C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                Priority;                                         		// 0x0054 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                FlourishID;                                       		// 0x0058 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_AchievementUnlocked
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_AchievementUnlocked_Parms
{
	struct FAchievementData                            Data;                                             		// 0x0000 (0x002C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FGrinderAchievement                         Grinder;                                          		// 0x002C (0x0018) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_AchievementChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_AchievementChange_Parms
{
	struct FString                                     sTitle;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sSubtitle;                                        		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sBody;                                            		// 0x0020 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                currentCount;                                     		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                totalCount;                                       		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_AmmoRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_AmmoRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_HeavyWeaponAmmoRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_HeavyWeaponAmmoRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_ElementZeroRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_ElementZeroRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_PlatinumRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_PlatinumRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_PalladiumRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_PalladiumRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_IridiumRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_IridiumRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_RenegadeChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_RenegadeChange_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_ParagonChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_ParagonChange_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_MedigelRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_MedigelRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_CreditRecovery
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_CreditRecovery_Parms
{
	int                                                nAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioHintSystemBase.AddNotification_CodexChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_CodexChange_Parms
{
};

// Function SFXGame.BioHintSystemBase.AddNotification_JournalChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_JournalChange_Parms
{
};

// Function SFXGame.BioHintSystemBase.AddNotification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UBioHintSystemBase_execAddNotification_Parms
{
	struct FSFXNotification                            oNotification;                                    		// 0x0000 (0x006C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGame.BioLevelUpSystem.AutoLevelUpPowers
// [0x00020802] ( FUNC_Event )
struct UBioLevelUpSystem_eventAutoLevelUpPowers_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class USFXPowerLevelUpHelper*                   Helper;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioLevelUpSystem.AttemptLevelUp
// [0x00022002] 
struct UBioLevelUpSystem_execAttemptLevelUp_Parms
{
	class ABioPlayerSquad*                             Squad;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             NewPlayerLevel;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             PlayerLevel;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             XPForNextLevel;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// float                                           CurrentXP;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	// class ASFXPawn_Player*                          Pawn;                                             		// 0x0020 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 member;                                           		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioLevelUpSystem.ExperienceNeededForLevel
// [0x00422400] ( FUNC_Native )
struct UBioLevelUpSystem_execExperienceNeededForLevel_Parms
{
	int                                                Level;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                experience;                                       		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioLevelUpSystem.LevelUpPawn
// [0x00022400] ( FUNC_Native )
struct UBioLevelUpSystem_execLevelUpPawn_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                newLevel;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.GetSpeedSpecifier
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execGetSpeedSpecifier_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	float                                              fSpeedToUse;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.GetMassSpecifier
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execGetMassSpecifier_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.UpdateLastCollidedActor
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execUpdateLastCollidedActor_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class AActor*                                      OtherActor;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioPhysicsSounds.UpdateLastTimePlayed
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execUpdateLastTimePlayed_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function SFXGame.BioPhysicsSounds.IsTooSlowToPlay
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execIsTooSlowToPlay_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.IsSameCollidedActor
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execIsSameCollidedActor_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class AActor*                                      OtherActor;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.IsTooSoonToPlay
// [0x00020400] ( FUNC_Native )
struct UBioPhysicsSounds_execIsTooSoonToPlay_Parms
{
	class UPrimitiveComponent*                         oComp;                                            		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.CanPlay
// [0x00420400] ( FUNC_Native )
struct UBioPhysicsSounds_execCanPlay_Parms
{
	class UPrimitiveComponent*                         oComp0;                                           		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         oComp1;                                           		// 0x0008 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0010 (0x0028) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0038 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPhysicsSounds.GetPhysMatWwiseType
// [0x00020002] 
struct UBioPhysicsSounds_execGetPhysMatWwiseType_Parms
{
	class UPhysicalMaterial*                           PhysMat;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             PhysMatWwiseType;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXPhysicalMaterialPhysics*              PhysMatPhysics;                                   		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioPhysicsSounds.GetWwiseEvent
// [0x00020002] 
struct UBioPhysicsSounds_execGetWwiseEvent_Parms
{
	class UPhysicalMaterial*                           PhysMat;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UWwiseEvent*                                 ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UWwiseEvent*                              PhysMatWwiseEvent;                                		// 0x0010 (0x0008) [0x0000000000000000]              
	// class USFXPhysicalMaterialPhysics*              PhysMatPhysics;                                   		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.BioPhysicsSounds.PlaySoundOnPhysMatAt
// [0x00020802] ( FUNC_Event )
struct UBioPhysicsSounds_eventPlaySoundOnPhysMatAt_Parms
{
	class AGameInfo*                                   Game;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UPhysicalMaterial*                           PhysMat;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UPhysicalMaterial*                           PhysMatSweetener;                                 		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     pos;                                              		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct TArray<struct FString>                      RTPCNames;                                        		// 0x0024 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct TArray<float>                               RTPCValues;                                       		// 0x0034 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class UWwiseEvent*                              PhysicsWwiseEvent;                                		// 0x0044 (0x0008) [0x0000000000000000]              
	// class ASFXGame*                                 SFXGameObj;                                       		// 0x004C (0x0008) [0x0000000000000000]              
	// int                                             SweetenerRTPCValue;                               		// 0x0054 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.BioPlotTreasure.GetMapName
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetMapName_Parms
{
	struct FString                                     sOutMapName;                                      		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPlotTreasure.GetPlotTreasureTechInt
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetPlotTreasureTechInt_Parms
{
	struct FName                                       nmTech;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmNameHeader;                                     		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmHeader;                                         		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nTechValue;                                       		// 0x0018 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPlotTreasure.GetPlotTreasureTechName
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetPlotTreasureTechName_Parms
{
	struct FName                                       nmTech;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmHeader;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmTechName;                                       		// 0x0010 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPlotTreasure.GetPlotTreasureTreasureName
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetPlotTreasureTreasureName_Parms
{
	int                                                nTreasureId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmHeader;                                         		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmPlotTreasureName;                               		// 0x000C (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPlotTreasure.GetPlotTreasureTreasureInt
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetPlotTreasureTreasureInt_Parms
{
	int                                                nTreasureId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmHeader;                                         		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPlotTreasureValue;                               		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioPlotTreasure.GetPlotTreasureResourcesInt
// [0x00420400] ( FUNC_Native )
struct UBioPlotTreasure_execGetPlotTreasureResourcesInt_Parms
{
	struct FName                                       nmLevel;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmHeader;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPlotTreasureValue;                               		// 0x0010 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.BioProceduralCameraBasic.FixedCamera
// [0x00C22002] 
struct UBioProceduralCameraBasic_execFixedCamera_Parms
{
	struct FActorInfo                                  stActorInfo;                                      		// 0x0000 (0x0054) [0x0000000000000080]              ( CPF_Parm )
	struct FCameraInfo                                 stCameraInfo;                                     		// 0x0054 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      bInvert;                                          		// 0x0074 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 rTmpRotator;                                      		// 0x0078 (0x000C) [0x0000000000000000]              
	// struct FVector                                  vTmpVector;                                       		// 0x0084 (0x000C) [0x0000000000000000]              
};

// Function SFXGame.BioSFResources.SetUsingGamepad
// [0x00020400] ( FUNC_Native )
struct UBioSFResources_execSetUsingGamepad_Parms
{
	unsigned long                                      gamepad;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.BioSFResources.PopulateBioScreenTipEntries
// [0x00020400] ( FUNC_Native )
struct UBioSFResources_execPopulateBioScreenTipEntries_Parms
{
};

// Function SFXGame.SFXDamageType.GetWeaponRange
// [0x00022802] ( FUNC_Event )
struct USFXDamageType_eventGetWeaponRange_Parms
{
	class UClass*                                      Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Range;                                            		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXDoorMarker.SuggestMovePreparation
// [0x00020802] ( FUNC_Event )
struct ASFXDoorMarker_eventSuggestMovePreparation_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXDoorMarker.ProceedWithMove
// [0x00020002] 
struct ASFXDoorMarker_execProceedWithMove_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXDoorMarker.SpecialHandling
// [0x00020802] ( FUNC_Event )
struct ASFXDoorMarker_eventSpecialHandling_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXDoorMarker.DoorClosed
// [0x00020002] 
struct ASFXDoorMarker_execDoorClosed_Parms
{
};

// Function SFXGame.SFXDoorMarker.DoorOpened
// [0x00020002] 
struct ASFXDoorMarker_execDoorOpened_Parms
{
};

// Function SFXGame.SFXDoorMarker.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ASFXDoorMarker_eventPostBeginPlay_Parms
{
};

// Function SFXGame.SFXDoorMarker.RestoreDoorMarkerBlockedState
// [0x00020400] ( FUNC_Native )
struct ASFXDoorMarker_execRestoreDoorMarkerBlockedState_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXDoorMarker.UnblockDoorMarker
// [0x00020400] ( FUNC_Native )
struct ASFXDoorMarker_execUnblockDoorMarker_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.ClearInitialTelemetryHandler
// [0x00040803] ( FUNC_Final | FUNC_Event )
struct USFXEngine_eventClearInitialTelemetryHandler_Parms
{
	// class UOnlinePlayerInterface*                   PlayerInterface;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.AddInitialTelemetryHandler
// [0x00040803] ( FUNC_Final | FUNC_Event )
struct USFXEngine_eventAddInitialTelemetryHandler_Parms
{
	// class UOnlinePlayerInterface*                   PlayerInterface;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.SendTelemetryOnProfileReadComplete
// [0x00020400] ( FUNC_Native )
struct USFXEngine_execSendTelemetryOnProfileReadComplete_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.FlushIOHandles
// [0x00020400] ( FUNC_Native )
struct USFXEngine_execFlushIOHandles_Parms
{
};

// Function SFXGame.SFXEngine.BioShowDebugMessageBox
// [0x00020400] ( FUNC_Native )
struct USFXEngine_execBioShowDebugMessageBox_Parms
{
	struct FString                                     sMessage;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.FindCurrentSaveDevice
// [0x00020400] ( FUNC_Native )
struct USFXEngine_execFindCurrentSaveDevice_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.IsCurrentDeviceValid
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execIsCurrentDeviceValid_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.ForceGUIUpdate
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execForceGUIUpdate_Parms
{
};

// Function SFXGame.SFXEngine.GetCurrentTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execGetCurrentTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.GetPlayTimeSeconds
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execGetPlayTimeSeconds_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.LoadPlayer
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execLoadPlayer_Parms
{
};

// Function SFXGame.SFXEngine.GetCurrentDevice
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execGetCurrentDevice_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.UpdateCurrentDevice
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execUpdateCurrentDevice_Parms
{
	int                                                DeviceID;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.SlowResumeGameCallback
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execSlowResumeGameCallback_Parms
{
	struct FSFXSaveGameCommandEventArgs                Args;                                             		// 0x0000 (0x005C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.FastResumeGameCallback
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execFastResumeGameCallback_Parms
{
	struct FSFXSaveGameCommandEventArgs                Args;                                             		// 0x0000 (0x005C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.ResumeGame
// [0x00824003] ( FUNC_Final )
struct USFXEngine_execResumeGame_Parms
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	// struct FSFXSaveDescriptor                       Descriptor;                                       		// 0x0010 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.GetProfileSettings
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execGetProfileSettings_Parms
{
	class USFXProfileSettings*                         ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ULocalPlayer*                             LP;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UDataStoreClient*                         DataStoreManager;                                 		// 0x0010 (0x0008) [0x0000000000000000]              
	// class UUIDataStore_OnlinePlayerData*            OnlinePlayerData;                                 		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.GetScaleFormManager
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execGetScaleFormManager_Parms
{
	class UMassEffectGuiManager*                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ULocalPlayer*                             LP;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.HandleNoFreeSpacePS3Callback
// [0x00040001] ( FUNC_Final )
struct USFXEngine_execHandleNoFreeSpacePS3Callback_Parms
{
	unsigned long                                      bAPressed;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                context;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.HandleNoFreeSpacePS3
// [0x00840003] ( FUNC_Final )
struct USFXEngine_execHandleNoFreeSpacePS3_Parms
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AdditionalFreeBytesNeeded;                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class USFXProfileSettings*                      ProfileSettings;                                  		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FBioMessageBoxOptionalParams             Params;                                           		// 0x0010 (0x0014) [0x0000000000000000]              
	// class UMassEffectGuiManager*                    GuiMan;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
	// struct FString                                  InsufficientSpaceTextWithSize;                    		// 0x002C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.SetCurrentSaveGame
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execSetCurrentSaveGame_Parms
{
	struct FSFXSaveDescriptor                          Descriptor;                                       		// 0x0000 (0x0028) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class USFXProfileSettings*                      ProfileSettings;                                  		// 0x0028 (0x0008) [0x0000000000000000]              
	// int                                             PreviousEncodedSaveDescriptor;                    		// 0x0030 (0x0004) [0x0000000000000000]              
	// int                                             EncodedSaveDescriptor;                            		// 0x0034 (0x0004) [0x0000000000000000]              
	// int                                             SafeIndex;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.SaveGameCallback
// [0x00040003] ( FUNC_Final )
struct USFXEngine_execSaveGameCallback_Parms
{
	struct FSFXSaveGameCommandEventArgs                Args;                                             		// 0x0000 (0x005C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.UpdateCurrentSaveGame
// [0x00020003] ( FUNC_Final )
struct USFXEngine_execUpdateCurrentSaveGame_Parms
{
	struct FSFXSaveDescriptor                          SaveDescriptor;                                   		// 0x0000 (0x0028) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.SaveGameEx
// [0x00020003] ( FUNC_Final )
struct USFXEngine_execSaveGameEx_Parms
{
	struct FSFXSaveDescriptor                          SaveDescriptor;                                   		// 0x0000 (0x0028) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.CheckForCorruptCareers
// [0x00820003] ( FUNC_Final )
struct USFXEngine_execCheckForCorruptCareers_Parms
{
	// class UMassEffectGuiManager*                    GuiMan;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UBioSFHandler_MessageBox*                 MessageBox;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FBioMessageBoxOptionalParams             Params;                                           		// 0x0010 (0x0014) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.RemoveCachedCareer
// [0x00020003] ( FUNC_Final )
struct USFXEngine_execRemoveCachedCareer_Parms
{
	struct FString                                     Career;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             Index;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.SFXEngine.ResumeRendering
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execResumeRendering_Parms
{
};

// Function SFXGame.SFXEngine.SuspendRendering
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execSuspendRendering_Parms
{
};

// Function SFXGame.SFXEngine.Callback_ConfirmDeleteCorruptCareers
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execCallback_ConfirmDeleteCorruptCareers_Parms
{
	unsigned long                                      bAPressed;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                context;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.ClearSaveCache
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execClearSaveCache_Parms
{
};

// Function SFXGame.SFXEngine.ValidCharsFilter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execValidCharsFilter_Parms
{
	struct FString                                     Sin;                                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bFilterAccentedChars;                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.CacheProfileData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execCacheProfileData_Parms
{
	class USFXProfileSettings*                         Profile;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.LoadSaveGame
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execLoadSaveGame_Parms
{
	class USFXSaveGame*                                SaveGame;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.IsPerformingSaveAction
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execIsPerformingSaveAction_Parms
{
	unsigned char                                      eAction;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.IsSaving
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execIsSaving_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.ScanSaveDataComplete
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execScanSaveDataComplete_Parms
{
	struct FSFXSaveGameCommandEventArgs                Args;                                             		// 0x0000 (0x005C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.ScanSaveData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execScanSaveData_Parms
{
};

// Function SFXGame.SFXEngine.TryGetCachedCareer
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execTryGetCachedCareer_Parms
{
	struct FString                                     Career;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FSFXCareerCacheEntry                        OutEntry;                                         		// 0x0010 (0x002C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x003C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.UpdateCareerCache
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execUpdateCareerCache_Parms
{
	struct FSFXSaveDescriptor                          SaveDescriptor;                                   		// 0x0000 (0x0028) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class USFXSaveGame*                                SaveGame;                                         		// 0x0028 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.ImportME2Character
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execImportME2Character_Parms
{
	class USFXSaveGame*                                SaveGame;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.ImportME1Character
// [0x00020003] ( FUNC_Final )
struct USFXEngine_execImportME1Character_Parms
{
	class USFXSaveGame*                                SaveGame;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.SFXEngine.ResumeSaveGameCommandExecution
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execResumeSaveGameCommandExecution_Parms
{
};

// Function SFXGame.SFXEngine.QueueSaveGameCommand
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execQueueSaveGameCommand_Parms
{
	unsigned char                                      Action;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FSFXSaveDescriptor                          SaveDescriptor;                                   		// 0x0004 (0x0028) [0x0000000000400092]              ( CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FScriptDelegate                             Callback;                                         		// 0x002C (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.ClearCurrentSaveDescriptor
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execClearCurrentSaveDescriptor_Parms
{
};

// Function SFXGame.SFXEngine.GetCurrentSaveDescriptor
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execGetCurrentSaveDescriptor_Parms
{
	struct FSFXSaveDescriptor                          ReturnValue;                                      		// 0x0000 (0x0028) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGame.SFXEngine.ParseCareer
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execParseCareer_Parms
{
	struct FString                                     Career;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     FirstName;                                        		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     ClassName;                                        		// 0x0020 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      Origin;                                           		// 0x0030 (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned char                                      Notoriety;                                        		// 0x0031 (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Year;                                             		// 0x0034 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Month;                                            		// 0x0038 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Day;                                              		// 0x003C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                MSSinceMidnight;                                  		// 0x0040 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0044 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.SFXEngine.GenerateCareer
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct USFXEngine_execGenerateCareer_Parms
{
	struct FString                                     FirstName;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ClassName;                                        		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      Origin;                                           		// 0x0020 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Notoriety;                                        		// 0x0021 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                Year;                                             		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
