/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_BIO2DA_INDEX_ERROR                                 -1
#define CONST_AI_NearMissDistance                                200
#define CONST_AI_NearbyHurtDistance                              500
#define CONST_TIMER_ADJUSTTOSLOT_LIMIT                           5.f
#define CONST_MAXSEARCHPATHLENGTH                                2000.0f
#define CONST_BIO_ACTION_ANIM_NODE_COUNT                         11

	SFXRC_MAX                                          = 5
};*/

// Enum SFXGame.SFXShield_Base.ResistanceType
/*enum ResistanceType
{
	ResistanceType_Shield                              = 0,
	ResistanceType_Armour                              = 1,
	ResistanceType_Biotic                              = 2,
	ResistanceType_MAX                                 = 3
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryGameDataType
/*enum ETelemetryGameDataType
{
	GameDataType_Load                                  = 0,
	GameDataType_Save                                  = 1,
	GameDataType_AutoSave                              = 2,
	GameDataType_ChapterSave                           = 3,
	GameDataType_EndGame                               = 4,
	GameDataType_Unknown                               = 5,
	GameDataType_MAX                                   = 6
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLogoutReason
/*enum ETelemetryLogoutReason
{
	LogoutStatus_Normal                                = 0,
	LogoutStatus_Error                                 = 1,
	LogoutStatus_OptOutTelemetry                       = 2,
	LogoutStatus_Unknown                               = 3,
	LogoutStatus_MAX                                   = 4
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLoginStatus
/*enum ETelemetryLoginStatus
{
	LoginStatus_Success                                = 0,
	LoginStatus_Error                                  = 1,
	LoginStatus_Cancel                                 = 2,
	LoginStatus_Unknown                                = 3,
	LoginStatus_MAX                                    = 4
};*/

// Enum SFXGame.SFXTelemetry.EBootEndReason
/*enum EBootEndReason
{
	BootEndReason_Normal                               = 0,
	BootEndReason_Error                                = 1,
	BootEndReason_OptOutTelemetry                      = 2,
	BootEndReason_Unknown                              = 3,
	BootEndReason_MAX                                  = 4
};*/

// Enum SFXGame.SFXTelemetryGameSession.EGameEndReason
/*enum EGameEndReason
{
	GameEndReason_Leave                                = 0,
	GameEndReason_GameEnd                              = 1,
	GameEndReason_Restart                              = 2,
	GameEndReason_Error                                = 3,
	GameEndReason_OptOutTelemetry                      = 4,
	GameEndReason_Unknown                              = 5,
	GameEndReason_MAX                                  = 6
};*/

// Enum SFXGame.SFXTracer.ESFXTracerScaling
/*enum ESFXTracerScaling
{
	eSFXTracerScaling_Idle                             = 0,
	eSFXTracerScaling_Up                               = 1,
	eSFXTracerScaling_Down                             = 2,
	eSFXTracerScaling_MAX                              = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGame.Bio_Appr_Character_Base_Settings
// 0x0004 (0x0074 - 0x0070)
class UBio_Appr_Character_Base_Settings : public UComponent
{
public:
	unsigned long                                      m_bIsShowingMissingResources : 1;                 		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Body_Settings
// 0x0016 (0x008A - 0x0074)
class UBio_Appr_Character_Body_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_HeadGear_Settings*       m_oHeadGearSettings;                              		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nModelVariant;                                  		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialConfig;                                		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHeadGearLoaded : 1;                          		// 0x0084 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadGearHidden : 1;                          		// 0x0084 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned char                                      m_eArmorType;                                     		// 0x0088 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eVisualOverride;                                		// 0x0089 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Hair_Settings
// 0x0004 (0x0078 - 0x0074)
class UBio_Appr_Character_Hair_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	int                                                m_nMaterial;                                      		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Head_Settings
// 0x0010 (0x0084 - 0x0074)
class UBio_Appr_Character_Head_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_Hair_Settings*           m_oHairSettings;                                  		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nMaterialConfig;                                		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nHairAppearance;                                		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_HeadGear_Settings
// 0x0025 (0x0099 - 0x0074)
class UBio_Appr_Character_HeadGear_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	struct FBioHeadGearComponentSettings               m_visor;                                          		// 0x0074 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FBioHeadGearComponentSettings               m_facePlate;                                      		// 0x0080 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nModelSpec;                                     		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nMaterialConfig;                                		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                     		// 0x0094 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      m_eVisualOverride;                                		// 0x0098 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.Bio_Appr_Character_Settings
// 0x0018 (0x008C - 0x0074)
class UBio_Appr_Character_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_Body_Settings*           m_oBodySettings;                                  		// 0x0074 (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	class UBio_Appr_Character_Head_Settings*           m_oHeadSettings;                                  		// 0x007C (0x0008) [0x00000000040A0009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nHeadAppearance;                                		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsHeadHidden : 1;                              		// 0x0088 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bIsHeadLoaded : 1;                              		// 0x0088 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioDestinationArrow
// 0x000A (0x0294 - 0x028A)
class ABioDestinationArrow : public AActor
{
public:
	class USkeletalMeshComponent*                      Mesh;                                             		// 0x028C (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventSetArrowColor ( unsigned char clr );
};

// Class SFXGame.BioHardLinks
// 0x0010 (0x0070 - 0x0060)
class UBioHardLinks : public UObject
{
public:
	struct TArray<struct FBioHardLinkReference>        References;                                       		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioHintSystemBase
// 0x0100 (0x0160 - 0x0060)
class UBioHintSystemBase : public UObject
{
public:
	struct FSFXNotification                            m_nCurrentlyDisplayedNotification;                		// 0x0060 (0x006C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct TArray<struct FHintDefinition>              m_aHints;                                         		// 0x00CC (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FSFXNotification>             m_aNotifications;                                 		// 0x00DC (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct TArray<struct FSFXNotificationData>         m_NotificationData;                               		// 0x00EC (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x00FC (0x0048) UNKNOWN PROPERTY: MapProperty SFXGame.BioHintSystemBase.m_mTrackingData
	class UTexture2D*                                  m_DefaultImage;                                   		// 0x0144 (0x0008) [0x0000000000000000]              
	int                                                nNotificationBodyLength;                          		// 0x014C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinimumTimeBetweenAnyHints;                    		// 0x0150 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fCurrentTime;                                   		// 0x0154 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nCurrentlyDisplayedHint;                        		// 0x0158 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      m_bEnabled : 1;                                   		// 0x015C (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      m_bDisabledForTutorial : 1;                       		// 0x015C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bNotificationIsPaused : 1;                      		// 0x015C (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      m_bNotificationIsVisible : 1;                     		// 0x015C (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	struct FString eventTruncateNotificationBody ( struct FString sBody );
	void eventCacheCurrentState ( );
	void Tick ( float TimeDelta );
	float TimeSince ( float fTime );
	float GetPreviousTime ( int nAge, struct FHintTrackingData* oData );
	struct FHintTrackingData GetTrackingData ( struct FName nmEvent, struct FName nmContext );
	void Clear ( );
	void HintEvent ( struct FName nmEvent, struct FName nmContext );
	void ClearNotifications ( );
	void OnNotificationCompleted ( );
	bool eventIsHintsOptionDisabled ( );
	void SetNotificationPaused ( unsigned long bVal );
	void eventJournalUpdate ( int srTitle, int srDescription );
	void eventCodexUpdate ( int srTitle, int srDescription );
	void PopulateNotificationOneParameter ( int nParam1, struct FSFXNotificationData* oNoteData, struct FSFXNotification* oNotification );
	struct FSFXNotificationData GetNotificationData ( struct FName nmNotificationType );
	void ShowNotification ( struct FSFXNotification* oNotification );
	void AddNotification_Custom ( float nDisplayTime, struct FString sTitle, struct FString sSubtitle, struct FString sBody, class UTexture* Image, struct FName nRemoteEvent, struct FName nmType, struct FName nmSound, int Priority, int FlourishID );
	void AddNotification_AchievementUnlocked ( struct FAchievementData* Data, struct FGrinderAchievement* Grinder );
	void AddNotification_AchievementChange ( struct FString sTitle, struct FString sSubtitle, struct FString sBody, int currentCount, int totalCount );
	void AddNotification_AmmoRecovery ( int nAmount );
	void AddNotification_HeavyWeaponAmmoRecovery ( int nAmount );
	void AddNotification_ElementZeroRecovery ( int nAmount );
	void AddNotification_PlatinumRecovery ( int nAmount );
	void AddNotification_PalladiumRecovery ( int nAmount );
	void AddNotification_IridiumRecovery ( int nAmount );
	void AddNotification_RenegadeChange ( int nAmount );
	void AddNotification_ParagonChange ( int nAmount );
	void AddNotification_MedigelRecovery ( int nAmount );
	void AddNotification_CreditRecovery ( int nAmount );
	void AddNotification_CodexChange ( );
	void AddNotification_JournalChange ( );
	void AddNotification ( struct FSFXNotification* oNotification );
};

// Class SFXGame.BioLayers
// 0x0028 (0x0094 - 0x006C)
class UBioLayers : public UBioBaseComponent
{
public:
	float                                              m_aEntry[ 0xA ];                                  		// 0x006C (0x0028) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioLevelUpSystem
// 0x0010 (0x0070 - 0x0060)
class UBioLevelUpSystem : public UObject
{
public:
	class UBio2DA*                                     m_aLevelUp2DA[ 0x2 ];                             		// 0x0060 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventAutoLevelUpPowers ( class ABioPawn* Pawn );
	bool AttemptLevelUp ( class ABioPlayerSquad* Squad );
	bool ExperienceNeededForLevel ( int Level, int* experience );
	bool LevelUpPawn ( class ABioPawn* Pawn, int newLevel );
};

// Class SFXGame.BioLoadingMovie
// 0x001C (0x007C - 0x0060)
class UBioLoadingMovie : public UObject
{
public:
	struct FString                                     MovieName;                                        		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UWwiseEventPairObject*                       LoadingMovieWwisePair;                            		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                LoopBackFrame;                                    		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioPhysicsSounds
// 0x0014 (0x0074 - 0x0060)
class UBioPhysicsSounds : public UObject
{
public:
	float                                              m_fMaxMass;                                       		// 0x0060 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMaxSpeed;                                      		// 0x0064 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinTimeBetweenSoundByActor;                    		// 0x0068 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinSpeedToPlay;                                		// 0x006C (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bEnableLogging : 1;                             		// 0x0070 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	float GetSpeedSpecifier ( class UPrimitiveComponent* oComp, float fSpeedToUse );
	float GetMassSpecifier ( class UPrimitiveComponent* oComp );
	void UpdateLastCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	void UpdateLastTimePlayed ( class UPrimitiveComponent* oComp );
	bool IsTooSlowToPlay ( class UPrimitiveComponent* oComp );
	bool IsSameCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	bool IsTooSoonToPlay ( class UPrimitiveComponent* oComp );
	bool CanPlay ( class UPrimitiveComponent* oComp0, class UPrimitiveComponent* oComp1, struct FCollisionImpactData* RigidCollisionData );
	int GetPhysMatWwiseType ( class UPhysicalMaterial* PhysMat );
	class UWwiseEvent* GetWwiseEvent ( class UPhysicalMaterial* PhysMat );
	void eventPlaySoundOnPhysMatAt ( class AGameInfo* Game, class UPhysicalMaterial* PhysMat, class UPhysicalMaterial* PhysMatSweetener, struct FVector pos, struct TArray<struct FString> RTPCNames, struct TArray<float> RTPCValues );
};

// Class SFXGame.BioPlaypenVolume
// 0x0014 (0x02E0 - 0x02CC)
class ABioPlaypenVolume : public AVolume
{
public:
	struct FGuid                                       PlaypenGuid;                                      		// 0x02CC (0x0010) [0x0000000000220003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	unsigned long                                      bSubtractive : 1;                                 		// 0x02DC (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioPlotTreasure
// 0x0018 (0x0078 - 0x0060)
class UBioPlotTreasure : public UObject
{
public:
	class UBio2DA*                                     oPlotTreasureResources2DA;                        		// 0x0060 (0x0008) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTreasure2DA;                         		// 0x0068 (0x0008) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTech2DA;                             		// 0x0070 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool GetMapName ( struct FString* sOutMapName );
	bool GetPlotTreasureTechInt ( struct FName nmTech, struct FName nmNameHeader, struct FName nmHeader, int* nTechValue );
	bool GetPlotTreasureTechName ( struct FName nmTech, struct FName nmHeader, struct FName* nmTechName );
	bool GetPlotTreasureTreasureName ( int nTreasureId, struct FName nmHeader, struct FName* nmPlotTreasureName );
	bool GetPlotTreasureTreasureInt ( int nTreasureId, struct FName nmHeader, int* nPlotTreasureValue );
	bool GetPlotTreasureResourcesInt ( struct FName nmLevel, struct FName nmHeader, int* nPlotTreasureValue );
};

// Class SFXGame.BioProceduralCameraBasic
// 0x0000 (0x0060 - 0x0060)
class UBioProceduralCameraBasic : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FixedCamera ( struct FActorInfo stActorInfo, unsigned long bInvert, struct FCameraInfo* stCameraInfo );
};

// Class SFXGame.BioRadarMapBoundaries
// 0x000E (0x0298 - 0x028A)
class ABioRadarMapBoundaries : public AActor
{
public:
	struct FVector                                     m_vBoundarySize;                                  		// 0x028C (0x000C) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSFResources
// 0x0044 (0x00A4 - 0x0060)
class UBioSFResources : public UObject
{
public:
	struct TArray<struct FBioSFSoundAssetResource>     Sounds;                                           		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UBioSFScreenTip*>              LoadScreenTips;                                   		// 0x0070 (0x0010) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	struct TArray<class UGFxMovieInfo*>                Movies;                                           		// 0x0080 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FBioSFScreenTipEntry>         BioScreenTipEntries;                              		// 0x0090 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bUsingGamepad : 1;                                		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void SetUsingGamepad ( unsigned long gamepad );
	void PopulateBioScreenTipEntries ( );
};

// Class SFXGame.BioSocketSupermodel
// 0x0010 (0x0434 - 0x0424)
class UBioSocketSupermodel : public USkeletalMesh
{
public:
	struct TArray<class USkeletalMesh*>                Dependents;                                       		// 0x0424 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioTacticalMoveToIndicator
// 0x0012 (0x029C - 0x028A)
class ABioTacticalMoveToIndicator : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleSystem;                                   		// 0x028C (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_fFadeInTime;                                    		// 0x0294 (0x0004) [0x0000000000000000]              
	float                                              m_fTimePassed;                                    		// 0x0298 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXActorFactoryRigidBody
// 0x0003 (0x00D4 - 0x00D1)
class USFXActorFactoryRigidBody : public UActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioActorFactoryPhysicsActor
// 0x0000 (0x00D4 - 0x00D4)
class UBioActorFactoryPhysicsActor : public USFXActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXDamageType
// 0x0051 (0x0111 - 0x00C0)
class USFXDamageType : public UDamageType
{
public:
	struct TArray<struct FHitReaction>                 HitReactions;                                     		// 0x00C0 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct FResistanceInfo                             Resistance;                                       		// 0x00D0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UForceFeedbackWaveform*                      ShieldHitFFWaveform;                              		// 0x00DC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBioVFXTemplate*                             DeathEffect;                                      		// 0x00E4 (0x0008) [0x0000000000000000]              
	class UBioVFXTemplate*                             PlayerFrameBufferEffect;                          		// 0x00EC (0x0008) [0x0000000000000000]              
	float                                              DamageRadius;                                     		// 0x00F4 (0x0004) [0x0000000000000000]              
	float                                              ShieldBonus;                                      		// 0x00F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ArmorBonus;                                       		// 0x00FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fChanceOfRagdoll;                                 		// 0x0100 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              fPhysicsReactionTimeScale;                        		// 0x0104 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                HeavyWeaponId;                                    		// 0x0108 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      bRadiusDamage : 1;                                		// 0x010C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSpawnWeaponImpacts : 1;                          		// 0x010C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bNoShieldBreakVFX : 1;                            		// 0x010C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bIgnoreShields : 1;                               		// 0x010C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bIgnoreShieldHitLimit : 1;                        		// 0x010C (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bPartBasedDamageDisabled : 1;                     		// 0x010C (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bIgnoreArmor : 1;                                 		// 0x010C (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      bHealthDamage : 1;                                		// 0x010C (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      bDamagesFriends : 1;                              		// 0x010C (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      bIgnoresBleedout : 1;                             		// 0x010C (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      bCausesPhysicsImpact : 1;                         		// 0x010C (0x0004) [0x0000000000004001] [0x00000400] ( CPF_Edit | CPF_Config )
	unsigned long                                      bCausesRagdoll : 1;                               		// 0x010C (0x0004) [0x0000000000004001] [0x00000800] ( CPF_Edit | CPF_Config )
	unsigned long                                      bResearchBonus_SniperArmorDamage : 1;             		// 0x010C (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bResearchBonus_HeavyPistolArmorDamage : 1;        		// 0x010C (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bResearchBonus_AssaultRifleResistanceDamage : 1;  		// 0x010C (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bResearchBonus_AutoPistolResistanceDamage : 1;    		// 0x010C (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      bResearchBonus_ShotgunResistanceDamage : 1;       		// 0x010C (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      bResearchBonus_SniperHeadShotBonus : 1;           		// 0x010C (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bImmediateDeath : 1;                              		// 0x010C (0x0004) [0x0000000000000001] [0x00040000] ( CPF_Edit )
	unsigned long                                      bIgnoresCoverDirection : 1;                       		// 0x010C (0x0004) [0x0000000000000001] [0x00080000] ( CPF_Edit )
	unsigned char                                      FalloffType;                                      		// 0x0110 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	float eventGetWeaponRange ( class UClass* Weapon, unsigned char Range );
};

// Class SFXGame.SFXDamageType_Suicide
// 0x0003 (0x0114 - 0x0111)
class USFXDamageType_Suicide : public USFXDamageType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXDoorMarker
// 0x0010 (0x039C - 0x038C)
class ASFXDoorMarker : public ANavigationPoint
{
public:
	class ASFXDoor*                                    MyDoor;                                           		// 0x038C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                nUnblockCount;                                    		// 0x0394 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	unsigned long                                      bWaitUntilCompletelyOpened : 1;                   		// 0x0398 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bInitiallyClosed : 1;                             		// 0x0398 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bBlockedWhenClosed : 1;                           		// 0x0398 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bDoorOpen : 1;                                    		// 0x0398 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bTempDisabledCollision : 1;                       		// 0x0398 (0x0004) [0x0000000000002002] [0x00000010] ( CPF_Const | CPF_Transient )
	unsigned long                                      bPrevBlockedState : 1;                            		// 0x0398 (0x0004) [0x0000000000002002] [0x00000020] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool eventSuggestMovePreparation ( class APawn* Other );
	bool ProceedWithMove ( class APawn* Other );
	class AActor* eventSpecialHandling ( class APawn* Other );
	void DoorClosed ( );
	void DoorOpened ( );
	void eventPostBeginPlay ( );
	int RestoreDoorMarkerBlockedState ( );
	int UnblockDoorMarker ( );
};

// Class SFXGame.SFXEngine
// 0x022C (0x0C45 - 0x0A19)
class USFXEngine : public UGameEngine
{
public:
	struct FUniqueNetId                                m_oInitialPlayerID;                               		// 0x0A1C (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FUniqueNetId                                m_oProfilePlayerID;                               		// 0x0A24 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FPlayerInfoEx                               DefaultPlayer;                                    		// 0x0A2C (0x0040) [0x0000000000406000]              ( CPF_Transient | CPF_Config | CPF_NeedCtorLink )
	struct FPlayerInfoEx                               NewPlayer;                                        		// 0x0A6C (0x0040) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FBlazeDataStore                             BlazeCache;                                       		// 0x0AAC (0x0028) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FGuid>                        DeadPawnList;                                     		// 0x0AD4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FKismetBoolSaveRecord>        SavedKismetList;                                  		// 0x0AE4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FHenchmanSaveRecord>          HenchmanRecords;                                  		// 0x0AF4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FDoorSaveRecord>              SavedDoorList;                                    		// 0x0B04 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FString>                      CorruptedCareers;                                 		// 0x0B14 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FSFXCareerCacheEntry>         CareerCache;                                      		// 0x0B24 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FScriptDelegate                             ResumeGameCompleteDelegate;                       		// 0x0B34 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FDynamicLoadInfo>             DynamicLoadMapping;                               		// 0x0B44 (0x0010) [0x0000000000404002]              ( CPF_Const | CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FPackageRemapInfo>            DynamicLoadPackageRemapping;                      		// 0x0B54 (0x0010) [0x0000000000404002]              ( CPF_Const | CPF_Config | CPF_NeedCtorLink )
	struct TArray<int>                                 AsyncLoadingMapping;                              		// 0x0B64 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FScriptDelegate                             __SFXSaveCommandCallback__Delegate;               		// 0x0B74 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnResumeGameComplete__Delegate;                 		// 0x0B84 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       PlayerLoadoutWeapons[ 0x6 ];                      		// 0x0B94 (0x0030) [0x0000000000000000]              
	struct FME1ImportBonusSaveRecord                   ME1ImportBonuses;                                 		// 0x0BC4 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	class USFXSaveGame*                                CurrentSaveGame;                                  		// 0x0BE0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USFXLegacyData*                              ME1ImportData;                                    		// 0x0BE8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USFXSaveGame*                                ME2ImportSaveGame;                                		// 0x0BF0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USFXTelemetry*                               Telemetry;                                        		// 0x0BF8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FName                                       m_DesiredStartPoint;                              		// 0x0C00 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	class USFXLoadMovieManager*                        LoadMovieManager;                                 		// 0x0C08 (0x0008) [0x0000000004402009]              ( CPF_Edit | CPF_ExportObject | CPF_Transient | CPF_NeedCtorLink | CPF_EditInline )
	float                                              LastSaveTime;                                     		// 0x0C10 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LastSecondsPlayed;                                		// 0x0C14 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CurrentUserID;                                    		// 0x0C18 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CurrentDeviceID;                                  		// 0x0C1C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CurrentLoadingTip;                                		// 0x0C20 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                AutoSaveInsufficientSpaceTextPS3;                 		// 0x0C24 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                InsufficentSpaceAcknowledgedText;                 		// 0x0C28 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CorruptCareerWarningText;                         		// 0x0C2C (0x0004) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	int                                                ConfirmDeleteCorruptText;                         		// 0x0C30 (0x0004) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	int                                                CancelDeleteCorruptText;                          		// 0x0C34 (0x0004) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	float                                              LastCantContinueTime;                             		// 0x0C38 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                srCantContinueErrorMessage;                       		// 0x0C3C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bCanWriteSaveToStorage : 1;                       		// 0x0C40 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bPendingSaveProfile : 1;                          		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bPendingDisableAutoSave : 1;                      		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bFlushInputRequested : 1;                         		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bPlayerNeedsLoad : 1;                             		// 0x0C40 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bPlayerLoadPosition : 1;                          		// 0x0C40 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      m_bRenderingSuspended : 1;                        		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      m_bInLoad : 1;                                    		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	unsigned long                                      m_bProfileInitialized : 1;                        		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      m_UseDesiredStartPoint : 1;                       		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bNewPlayer : 1;                                   		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      bStartedGame : 1;                                 		// 0x0C40 (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      IsDebuggingCharactionCreation : 1;                		// 0x0C40 (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
	unsigned long                                      DebugCharacterIsMale : 1;                         		// 0x0C40 (0x0004) [0x0000000000002000] [0x00002000] ( CPF_Transient )
	unsigned long                                      DebugUseIconicShepard : 1;                        		// 0x0C40 (0x0004) [0x0000000000002000] [0x00004000] ( CPF_Transient )
	unsigned char                                      PendingModeToRemove;                              		// 0x0C44 (0x0001) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventClearInitialTelemetryHandler ( );
	void eventAddInitialTelemetryHandler ( );
	void SendTelemetryOnProfileReadComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void FlushIOHandles ( );
	void BioShowDebugMessageBox ( struct FString sMessage );
	bool FindCurrentSaveDevice ( );
	bool IsCurrentDeviceValid ( );
	void ForceGUIUpdate ( );
	float GetCurrentTime ( );
	float GetPlayTimeSeconds ( );
	void LoadPlayer ( );
	int GetCurrentDevice ( );
	void UpdateCurrentDevice ( int DeviceID );
	void SlowResumeGameCallback ( struct FSFXSaveGameCommandEventArgs Args );
	void FastResumeGameCallback ( struct FSFXSaveGameCommandEventArgs Args );
	void ResumeGame ( struct FScriptDelegate Callback );
	class USFXProfileSettings* GetProfileSettings ( );
	class UMassEffectGuiManager* GetScaleFormManager ( );
	void HandleNoFreeSpacePS3Callback ( unsigned long bAPressed, int context );
	void HandleNoFreeSpacePS3 ( unsigned char Type, int AdditionalFreeBytesNeeded );
	void SetCurrentSaveGame ( struct FSFXSaveDescriptor Descriptor );
	void SaveGameCallback ( struct FSFXSaveGameCommandEventArgs Args );
	void UpdateCurrentSaveGame ( struct FSFXSaveDescriptor SaveDescriptor );
	void SaveGameEx ( struct FSFXSaveDescriptor SaveDescriptor );
	void CheckForCorruptCareers ( );
	bool RemoveCachedCareer ( struct FString Career );
	void ResumeRendering ( );
	void SuspendRendering ( );
	void Callback_ConfirmDeleteCorruptCareers ( unsigned long bAPressed, int context );
	void ClearSaveCache ( );
	struct FString ValidCharsFilter ( struct FString Sin, unsigned long bFilterAccentedChars );
	void CacheProfileData ( class USFXProfileSettings* Profile );
	void LoadSaveGame ( class USFXSaveGame* SaveGame );
	bool IsPerformingSaveAction ( unsigned char eAction );
	bool IsSaving ( );
	void ScanSaveDataComplete ( struct FSFXSaveGameCommandEventArgs Args );
	void ScanSaveData ( );
	bool TryGetCachedCareer ( struct FString Career, struct FSFXCareerCacheEntry* OutEntry );
	void UpdateCareerCache ( struct FSFXSaveDescriptor SaveDescriptor, class USFXSaveGame* SaveGame );
	void ImportME2Character ( class USFXSaveGame* SaveGame );
	void ImportME1Character ( class USFXSaveGame* SaveGame );
	void ResumeSaveGameCommandExecution ( );
	void QueueSaveGameCommand ( unsigned char Action, struct FSFXSaveDescriptor SaveDescriptor, struct FScriptDelegate Callback );
	void ClearCurrentSaveDescriptor ( );
	struct FSFXSaveDescriptor GetCurrentSaveDescriptor ( );
	bool ParseCareer ( struct FString Career, struct FString* FirstName, struct FString* ClassName, unsigned char* Origin, unsigned char* Notoriety, int* Year, int* Month, int* Day, int* MSSinceMidnight );
	void GenerateCareer ( struct FString FirstName, struct FString ClassName, unsigned char Origin, unsigned char Notoriety, int Year, int Month, int Day, int MSSinceMidnight, struct FString* OutCareer, struct FString* OutDisplayName );
	void CreateCareerInternal ( struct FString FirstName, struct FString ClassName, unsigned char Origin, unsigned char Notoriety, int Year, int Month, int Day, int MSSinceMidnight );
	void CreateCareer ( struct FString FirstName, int srClass, unsigned char Origin, unsigned char Notoriety );
	void OnResumeGameComplete ( unsigned long bWasSuccessful );
	void SFXSaveCommandCallback ( struct FSFXSaveGameCommandEventArgs Args );
	float CurrentSystemTimeSeconds ( );
	void ReleaseSeekFreeObject ( struct FString ObjectName );
	class UObject* LoadSeekFreeObjectAsync ( struct FString Object, class UClass* ObjectClass, unsigned char* Status );
	class UObject* LoadSeekFreeObject ( struct FString ObjectName, class UClass* ObjectClass );
	bool IsSeekFreeObjectSupported ( struct FString ObjectName );
	void LaunchUnreaperWithDiscCheck ( );
	void LaunchUnreaper ( );
	void ReLaunchExecutable ( );
	void SkipMovie ( );
	void ResetForcedInactiveParticleSystems ( );
	class USFXEngine* GetEngine ( );
	struct FPlayerInfoEx CurrentPlayerInfo ( );
};

// Class SFXGame.SFXGalaxyMapObject
// 0x003E (0x009E - 0x0060)
class USFXGalaxyMapObject : public UObject
{
public:
	struct FString                                     Tag;                                              		// 0x0060 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                PosX;                                             		// 0x0070 (0x0004) [0x0000000000000000]              
	int                                                PosY;                                             		// 0x0074 (0x0004) [0x0000000000000000]              
	int                                                TableID;                                          		// 0x0078 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                DisplayName;                                      		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nPreviouslySelectedIndex;                         		// 0x0084 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                VisibleConditional;                               		// 0x0088 (0x0004) [0x0000000000000000]              
	int                                                VisibleParameter;                                 		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                UsableConditional;                                		// 0x0090 (0x0004) [0x0000000000000000]              
	int                                                UsableParameter;                                  		// 0x0094 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      VisibleConditionalRegion;                         		// 0x0098 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      VisibleConditionalPlot;                           		// 0x0099 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      VisibleConditionalName;                           		// 0x009A (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      UsableConditionalRegion;                          		// 0x009B (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      UsableConditionalPlot;                            		// 0x009C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      UsableConditionalName;                            		// 0x009D (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventEnumerateChildren ( );
	void eventGetChildren ( struct TArray<class USFXGalaxyMapObject*>* Children );
	void eventRemoveChild ( class USFXGalaxyMapObject* Child );
	class USFXGalaxyMapObject* eventAddChild ( );
};

// Class SFXGame.BioPlanet
// 0x011E (0x01BC - 0x009E)
class UBioPlanet : public USFXGalaxyMapObject
{
public:
	struct TArray<struct FPlanetSun>                   Suns;                                             		// 0x00A0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class USFXPlanetFeature*>            Features;                                         		// 0x00B0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MapName;                                          		// 0x00C0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ImageBackground;                                  		// 0x00D0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     PlanetEvent;                                      		// 0x00E0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FLinearColor                                RingColor;                                        		// 0x00F0 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                CloudColor;                                       		// 0x0100 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                CoronaColor;                                      		// 0x0110 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	class UGFxMovieInfo*                               PreviewImageResource;                             		// 0x0120 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInstanceConstant*                   PlanetMaterial;                                   		// 0x0128 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInstanceConstant*                   CloudMaterial;                                    		// 0x0130 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPrefab*                                     ScenePrefab;                                      		// 0x0138 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  TextureParam;                                     		// 0x0140 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Description;                                      		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ButtonLabel;                                      		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MissionBriefing;                                  		// 0x0150 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ResourceRichness;                                 		// 0x0154 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PlanetRotation;                                   		// 0x0158 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Opacity;                                          		// 0x015C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FringeBloom;                                      		// 0x0160 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RelativeSize;                                     		// 0x0164 (0x0004) [0x0000000000000000]              
	float                                              DefaultDisplaySize;                               		// 0x0168 (0x0004) [0x0000000000000000]              
	float                                              TerrainDepthFactor;                               		// 0x016C (0x0004) [0x0000000000000000]              
	float                                              UnscaledMineralsSum;                              		// 0x0170 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              PlacedMineralsPool;                               		// 0x0174 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              RandomMineralsBase;                               		// 0x0178 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              EezoMineralsBase;                                 		// 0x017C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ScanBarMaxMineralSize;                            		// 0x0180 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                PlanetLandCondition;                              		// 0x0184 (0x0004) [0x0000000000000000]              
	int                                                PlanetEventCondition;                             		// 0x0188 (0x0004) [0x0000000000000000]              
	int                                                PlanetEventParameter;                             		// 0x018C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlanetEventTransition;                            		// 0x0190 (0x0004) [0x0000000000000000]              
	int                                                PlanetEventTransitionParameter;                   		// 0x0194 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlanetEventMessage;                               		// 0x0198 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlanetPlotLabel;                                  		// 0x019C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlanetPlotLabelCondition;                         		// 0x01A0 (0x0004) [0x0000000000000000]              
	int                                                ActiveWorld;                                      		// 0x01A4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      AlreadyExplored : 1;                              		// 0x01A8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bInitialized : 1;                                 		// 0x01A8 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned char                                      PlanetType;                                       		// 0x01AC (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      OrbitRing;                                        		// 0x01AD (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      SystemLevelType;                                  		// 0x01AE (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetLevelType;                                  		// 0x01AF (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetLandConditionRegion;                        		// 0x01B0 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetLandConditionPlot;                          		// 0x01B1 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetLandConditionName;                          		// 0x01B2 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventConditionRegion;                       		// 0x01B3 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventConditionPlot;                         		// 0x01B4 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventConditionName;                         		// 0x01B5 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventTransitionRegion;                      		// 0x01B6 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventTransitionPlot;                        		// 0x01B7 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetEventTransitionName;                        		// 0x01B8 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetPlotLabelConditionRegion;                   		// 0x01B9 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetPlotLabelConditionPlot;                     		// 0x01BA (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlanetPlotLabelConditionName;                     		// 0x01BB (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventEnumerateChildren ( );
	int eventGetScaledResourceAmount ( unsigned char MineralType, float UnscaledAmount );
	void RemoveChild ( class USFXGalaxyMapObject* Child );
	void GetChildren ( struct TArray<class USFXGalaxyMapObject*>* Children );
	class USFXGalaxyMapObject* AddChild ( );
	struct FVector SphereToPlanePos ( struct FVector vSphere, float SphereRadius );
	struct FVector PlanePosToSphere ( struct FVector vPosition2D, float SphereRadius );
	float GetPlanetSize ( );
	void LoadPlanetData ( class AInterpActor* Planet, struct TArray<class UParticleSystemComponent*>* TemporaryComponents );
	void LoadProbeImpacts ( struct TArray<struct FVector>* vImpacts );
	void SaveProbeImpact ( struct FVector vImpact );
